label glava2:
    $persistent.progress = "2"
    scene black with dissolve
    show text "{color=#e67bbd}глава 2\n[chapters[1][0]]{/color}" with Pause(1.5)
    scene black with dissolve
    scene larsroom with dissolve 
    show pink zorder 10
    show lars yellow
    "тебя разбудил лязг металла под твоей кроватью - твой друг бесцеремонно спустился в подвал тягать штангу"
    "более того, адские звуки бьющегося о пол железа сопровождались рёвом колонок, издающих неразберимые гортанные рёвы и неистовое пиликанье электрогитар"
    l "нахуя он сатану призывает"
    "не желая запачкать пижаму пылью с качалки (клининг в подвал приходил всего раз в две недели, ты экономил бабки, чтобы тратить их на энергетики и ашкюди), ты сначала переоделся"
    "а потом уже спустился высказывать дэйву, что тот малость прихуеть успел за ночь"
    scene gym_morning with dissolve 
    show gym_light zorder 10
    show dave pink smile at my_right
    show lars irritated at move_x_from(-1, 0.33)
    l "тебя когда-то будили минетом?"
    d "да но с тех пор я сплю с закрытым ртом"
    show lars please with dissolve 
    l "ты в курсе что все слышно??"
    show dave pink normal with dissolve 
    d "ты серьёзно?"
    d "кто проектировал этот дом лол"
    d "из подвала звук не должен доходить"
    d "если конечно ты не живёшь прям под ним"
    show lars normal with dissolve 
    l "вот я про то же!"
    "ты посмотрел на экран"
    "да, у тебя был телек в качалке"
    l "боже мой"
    l "это что за гей-парад в аду"
    show dave pink sad with dissolve 
    d "это сепультура"
    show lars please with dissolve 
    l "какая физкультура"
    d "да похуй забей ржу тут с этих гомодрил патлатых вот и смотрю"
    show lars smile with dissolve 
    l "ха-ха на то они и нужны чтобы ржать лол клоуны нестриженные"
    "дэйв с печалью посмотрел на тебя и вырубил телек"
    show lars normal with dissolve 
    l "ты чё такой (((("
    l "у тебя лицо как у той готки которую мы вчера обрадовали перестановкой в магазине"
    show dave pink normal with dissolve 
    d "тебе показалось"
    l "ну ок"
    d "я зарядку делал а ты меня прервал"
    show lars smile with dissolve  
    l "ебать у тебя зарядка я это в жизни не подниму"
    d "так это не моя штанга её твой батя оставил"
    d "моя вдвое легче"
    l "и её я не подниму"
    d "есть куда стремиться"
    show dave pink sad with dissolve 
    d "я хотя бы что-то тяжелее вейпа поднять могу"
    l "закладку с бордюра?"
    d "даже не смешно"
    show dave pink smile with dissolve 
    "дэйв выхватил твою дудку, затянулся, а затем запрыгнул на турник и начал подтягиваться с таким отсутствием усилий, будто бы раз 100 мог это сделать"
    "ты кстати не знал, сколько он за подход мог подтянуться"
    "тебе на всю эту качалку было ровно как и аудитории дэйва похуй"
    "рыжий просто порой был ебаным нарциссом и дрочил на зеркало - оттого и потел в зале, чтобы было на что дрочить"
    "ну и девки ему давали"
    show lars normal with dissolve 
    "а ты завидовал"
    l "закончил?"
    show dave pink smile with dissolve 
    d "кончил"
    d "ща как сделаю напас сразу разъебет как надо после нагрузки"
    show lars irritated with dissolve 
    l "напас он сделает"
    l "намаз"
    show lars normal with dissolve 
    l "мы договаривались"
    l "нельзя пыхать перед учёбой"
    show lars normal with dissolve 
    l "ты расписание смотрел?"
    show dave pink normal with dissolve 
    d "ну да две с хэтфилдом и высшая математика с полупокером каким-то"
    l "ну вот"
    l "хэтфилд вещи рассказывает а ты хочешь прийти как объёбус"
    menu:
        "у тебя зависимость что ли?":
            jump zav
        "это оскорбить его может":
            jump osk
    label osk:
        show dave pink sad with dissolve 
        "дэйв многоворяще сплюнул на пол"
        d "ещё заплачет скажи"
        $dave_rel -= 1
        d "мир так крутится вертится так устроен что должно быть похуй"
        d "иначе тебя самого с говном смешают а жалеть уже никто не будет"
        d "мне насрать кого это оскорбит я передумал потому что я хотя слушать его собираюсь"
        show lars sad with dissolve 
        l "подавись своей анашой"
        show lars normal with dissolve 
        l "если тебе так важны его пары пошли уже жрать и на улицу"
    jump prot
    label zav:
        "дэйв замолчал и поковырял пол ботинком в раздумьях"
        d "ты прав"
        $brain_dave += 1
        d "мы пришли учиться"
        d "дунем после пар"
        show lars smile with dissolve        
        l "вот это понимаю настрой)"
        l "я с тобой тогда"
        "ты будто бы на что-то влиял"
        "воспитывал в дэйве... ответственность, что ли?"
        "ты ведь добра ему желал"
        "и правда ну искренне надеялся, что его увлечение всем этим два два восемь не перерастёт в систематическое употребление"
        "чтобы он доучился и стал инженером, как хотел"
        l "ну чё пошли тогда пожрём и на пары"
    jump prot
label prot:
    l "протеин будешь?"
    show dave pink smile with dissolve 
    d "тебе слабо целый шейкер натеребонькать"
    show lars smile with dissolve 
    l "проверим?"
    jump zavtrak
label zavtrak:
    scene kitchen
    show dave normal at my_right
    show lars normal
    show dave side2 at move_x (0.85)
    "дэйв открыл холодильник и, не оценив выставленную в ряд коллекцию всех вкусов монстра, тут же захлопнул дверцу"
    show dave side1 at move_x (0.6)
    d "моется вовочка с мамой в ванной"
    show dave think with dissolve 
    d "мама-мама что это у тебя там внизу?"
    d "что бог послал отвечает мама"
    d "помылись садятся всей семьёй завтракать"
    d "мама-мама что на завтрак?"
    d "что бог послал отвечает мама"
    d "фуууу я эту волосатую есть не буду!!"
    show lars please with dissolve 
    l "да понял я что жрать нечего"
    show dave sad with dissolve 
    d "ты бы хоть яйцами обзавелся"
    l "ага и большой жирной сосиской"
    show lars smile with dissolve 
    l "в холодосе не храню но могу угостить"
    show dave angry with dissolve 
    d "иди нахуй я не хочу как ты жрать только чипсы чтоб меня ветром сдувало"
    show lars please with dissolve 
    l "большой шкаф громче падает"
    d "попробуй урони)"
    show lars normal with dissolve 
    l "шаурму у шараги поешь понял я тебя вечером будет еда"
    show dave think with dissolve 
    d "пошли тогда"
    "позавтракав сигаретами с растворимым кофе как два нищеёба, вы выдвинулись к колледжу"
    show smoke zorder 10
    scene classroom
    show electric zorder 10
    show dave think at my_left_left
    show lars normal at my_left
    show nick smile at left 
    d "а про нипель есть у меня история"
    n "давай"
    d "с одной сукой разборки устроили"
    d "в клуб хотела ночью умотать"
    d "без меня с какими-то девками левыми"
    "ты порадовался, что друг нашёл себе собеседника и лёг головой на парту, ожидая начала занятий"
    "через окно ты видел, как хэтфилд курил у ворот колледжа, но решил не мешать - пускай на рабочий день настроится, а потом ты уже запустишь свои приставания"
    "приставания в области учёбы, безусловно"
    show nick sad with dissolve 
    n "вот шкура!"
    show dave sad with dissolve 
    d "я короче скрутил нипель в колесе её тачки"
    show dave think with dissolve 
    d "а она взяла и поехала со спущенным колесом!"
    show nick smile with dissolve 
    n "нихуя ты юморной"
    show nick sad with dissolve 
    n "они хоть живы остались?"
    d "там одна из баб с мозгами была и вовремя заметила"
    d "только я все равно потом её нахуй послал"
    d "да срать на неё) тачка цела и ладно"
    show dave sad with dissolve 
    d "охуенная машина я на на ней дрифтить научился"
    "дэйв ещё что-то рассказал про нюансы с починкой автомобиля данной девушки, про какие-то запчасти - тебе было пофиг"
    "хэтфилд в окне задумчиво пялился на чертолёт дэйва" 
    "сегодня вы планировали заехать в гипермаркет за продуктами, вот и пришлось тебе трястись из-за плохой подвески и от страха под аккомпанемент басбустед фонка"
    "интересно, а джеймс знает толк в машинах?"
    "такое чувство, что да"
    "ты не ревновал, нет, но..."
    "нет нет нет дэйв не увезет джеймса на девятке в таджикистан, у него машина пополам согнется от такого веса"
    "если отбросить в сторону шутки - надо, чтобы у тебя общего с хэтфилдом было больше, чем у дэйва"
    "зачем, правда?.."
    d "ну так я и стал мужчиной аж в тринадцать лет"
    d "что про себя скажешь?"
    n "шестнадцать"
    n "три семёрки с дурой выпили и поебалися"
    d "респект"
    show lars irritated with dissolve 
    "ты ненавидел эту тему, но не мог не вставить свои пять копеек"
    l "а я вот лучше свою девственность потеряю не лишь бы её потерять а чтобы уж наверняка и не с блядиной вокзальной а с честной и красивой"
    show dave angry with dissolve 
    d "тебе просто не дают"
    "больная тема"
    "да, это глупо, но дэйв перетрахал половину города и даже звал тебя с собой пару раз"
    "ты надеялся, что друг не станет рассказывать, во что это вылилось"
    "тебе одна девчонка даже понравилась - смотреть, как её приходует твой друг, оказалось чем-то извращенно, болезненно приятным..."
    show lars sad with dissolve 
    "фу блять, больше не надо это вспоминать"
    show lars normal with dissolve 
    l "ну и хорошо что не дают нахер они нужны"
    show dave think with dissolve 
    d "все из-за того что ты женщин ненавидишь"
    show lars please with dissolve
    n "лучше нет влагалища чем очко товарища?"
    show lars sad with dissolve 
    l "да блять(("
    show james normal at move_x_from(1.5, 0.8)
    d "женщина это бутерброд долгосрочного приготовления - сначала пахнет рыбой а с годами хлебом ахаха"
    n "пиздец..."
    show lars smile with dissolve 
    l "пиздец..."
    j "что-то правда перебор уже"
    show dave smile with dissolve 
    d "ой здравствуйте мистер хэтфилд"
    show james sad with dissolve 
    j "женщины - прекрасные создания и чудо природы их надо оберегать и радовать а не гадости про них говорить"
    "ты посмотрел в пол - ты считал иначе"
    menu:
        "зависит от женщины достойна она любви или нет":
            jump zavwoman
        "вы правы простите нас за наши шутки":
            jump sorrywoman
label zavwoman:
    show dave think with dissolve 
    "дэйв удивлённо на тебя посмотрел"
    $dave_rel += 1
    d "бля красава свое мнение имеешь"
    d "я тоже считаю что сука суке рознь и все пёзды мира вылизать не получится"
    show james blush with dissolve 
    j "дэйв в классе дамы сидят да и имей совесть при мне хотя бы так не выражаться"
    show james sad with dissolve 
    j "ты этим ртом хлеб ешь"
    show lars normal with dissolve 
    l "еб... ой то есть офигеть"
    show james normal with dissolve 
    j "вот-вот"
    j "давайте же к занятию приступим"
    j "тема интереснее будет чем обсуждать какова пизда на вкус"
    "мат из уст джеймса прозвучал так непривычно что ты аж подпрыгнул"
    show james smile with dissolve 
    j "надеюсь вы меня поняли"
    show dave smile with dissolve 
    d "поняли"
    jump array
label sorrywoman:
    show dave angry with dissolve 
    d "за себя говори"
    d "я лично от шуток не отрекаюсь потому что мне правда смешно"
    show james normal with dissolve 
    j "ну вообще смешно"
    j "я по молодости тоже такой юмор любил"
    show lars please with dissolve 
    l "ах а вам значит можно"
    show james smile with dissolve 
    j "как называют небритую вагину? селёдка под шубой"
    show lars smile with dissolve 
    l "а забавно"
    show james normal with dissolve 
    j "вот я и об этом"
    j "шутите сколько влезет главное без злости"
    j "ладно"
    j "давайте же начнём наше занятие"
    jump array
label array:
    "к началу занятий подтянулись ещё ребята"
    "они сели на задние парты, как лошки и полупокеры и слава богу аллаху будде макарнному монстру"
    show james normal at move_x (0.6)
    show kirk normal at move_x_from (2, 0.9)
    j "первым делом хочу поблагодарить тех кто сделал вводное задание"
    if dz_1 and dave_ur:
        "джеймс тепло посмотрел на тебя"
        $james_rel += 0.5
        j "молодцы мальчики - всю пару бесились а домашку сделали"
        j "это показатель"
        $hetstaine += 0.5
        "он ведь догадался, что это ты дэйва уговорил?"
        show lars smile with dissolve 
        l "да легкотня я бы и задание сложнее затащил"
        l "поднял в касание как говорится"
        jump questions
    if dave_ur:
        $hetstaine += 0.5
        "джеймс удивленно взглянул на тебя - ты убрал телефон и одарил препода таким же вопрошающим взглядом"
        j "тяжело было?"
        show lars sad with dissolve
        l "да я в системе ничего не понял я бы все написал на изи"
        show james smile with dissolve
        j "прям на изи-изи?"
        show lars smile with dissolve
        l "да по чесноку бляд... ой проституткой то есть буду если не изи-изи"
        show dave smile with dissolve
        d "так уже"
        show lars please with dissolve
        l "иди нахуй ржавчина"
        show james sad with dissolve
        j "мальчики(( речь"
        show james normal with dissolve
        j "базар как вода - если плохо фильтровать откажут почки"
        show lars smile with dissolve
        l "mudro"
        l "в общем про что я"
        l "я с интерфейсом не разобрался а задание бы взял и сложнее"
    if not dave_ur:
        "джеймс задумчиво прошёл мимо дэйва, нарочито отказавшегося от домашки"
        j "что не сделал-то?"
        j "не верю что тебе не под силу"
        show dave angry with dissolve 
        d "мне все под силу мне просто лень"
        j "это не лучший подход"
        show james smile with dissolve 
        j "учёба - это не только одно интересное"
        j "лени нельзя потакать - следующее дз постарайся всё выполнить"
        jump questions
        if dz_1:
            "препод перевёл взгляд на тебя"
            $james_rel += 0.5
            j "ты это тяни понемногу своего друга"
            show james normal with dissolve 
            j "такой смышленный парень а талант в землю зарывает"
            show lars please with dissolve 
            l "очко я ему растяну штангенциркулем"
            l "сам пусть делает свои уроки"
            show lars normal with dissolve 
            l "мне кстати задание показалось лёгким"
            l "я бы и сложнее решил запросто!"
            jump questions 
        else:
            "препод с небольшим упреком обратился к тебе"
            show james sad with dissolve 
            j "работать надо не только на занятиях - учёбой является совокупность и теории и практики"
            show lars sad with dissolve 
            l "да я не понял как там все работает ((("
            show james normal with dissolve 
            j "ты пиши если что - на платформе с дз есть мой контакт"
            show james smile with dissolve 
            j "не стесняйся"
            show james normal with dissolve 
            show lars normal with dissolve
            l "мы сделаем следующее дз обязательно"
            l "я понял тему я читал дополнительные материалы что вы дали"
            l "серьёзно"
            l "можете хоть это хоть сложнее что-то меня спросить"
            jump questions
label questions:
    show lars smile with dissolve 
    show dave angry with dissolve 
    d "а жопа не треснет сложнее задание он хочет"
    d "ты и тут ковырялся как гинеколог на автослесаря переученный"
    d "если хочешь чтобы тебя выебали необязательно для этого компьютер включать"
    show james sad with dissolve 
    j "по-моему я просил следить за речью"
    "дэйв повернулся к тебе"
    d "слыш базар фильтруй"
    show lars please with dissolve 
    l "бананы из ушей вынь это он про тебя"
    d "в смыыысле"
    show lars normal with dissolve 
    "ты закатил глаза - уж очень дэйву нравилось паясничать"
    show james normal with dissolve 
    j "кто-то хотел посложнее? сейчас будет"
    l "о-оу"
    j "не переживай у тебя будет вопрос на пятёрку - не ответишь не поставлю"
    j "а те кто плюёт на правила получают вопросы на двойку - ставлю два если ответ неверный"
    show lars smile with dissolve 
    l "чё доплевался верблюд горбатый"
    show dave sad with dissolve 
    d "верблюд у тебя в штанах"
    d "давайте свой вопрос мистер хэтфилд"
    j "зря радуешься"
    j "ларс тебе вопрос попроще на тему дз"
    show lars normal with dissolve 
    j "тебе надо было создать переменные с типами строка и число"
    j "потом ты писал print и всё печаталось"
    j "так вот если имя строка возраст число то print каким типом будет?"
    menu:
        "строка":
            jump nev
        "число":
            jump nev
        "ни то ни другое":
            jump vern
label nev:
    j "а почему ты так считаешь?"
    show lars sad with dissolve 
    l "н-не знаю"
    l "я промазал?"
    show lars normal with dissolve 
    j "ничего страшного"
    j "на то он и вопрос на пятёрку"
    j "типов данных в программировании много и мы обязательно это пройдём"
    j "а так на будущее - print является функцией"
    "дэйв показал тебе язык, а ты ему - средний палец"
    jump daveq 
label vern:
    show james smile with dissolve 
    j "молодец"
    j "print - ни число и не строка а функция"
    show james normal with dissolve 
    j "причём созданная не тобой иначе бы тебе пришлось объявлять её самостоятельно"
    show lars normal with dissolve 
    l "эммм ну да"
    j "да не стесняйся ты так всё ты прекрасно понимаешь"
    $james_rel += 0.5
    jump daveq
label daveq:
    show dave angry with dissolve 
    d "охренеть америку открыли print это функция"
    show dave think with dissolve 
    d "и это был вопрос на пятёрку?"
    d "как вывести данные лол"
    d "что же на двойку-то будет?"
    d "как ввести данные да?"
    show james smile with dissolve 
    j "смотрю хочешь вперёд паровоза бежать?"
    show james normal with dissolve 
    show dave smile with dissolve 
    d "россия живёт скоростями)"
    j "ну давай скоростной ты наш посмотрим что ты скажешь на это"
    show lars sad with dissolve 
    "джеймс с дэйвом... флиртовал??"
    "блин нет нет не мог ни в коем случае!!"
    "ему с мастейном просто интересно как двум людям, занятым общим делом"
    "плюс твой друг ревнует тебя к хэтфилду а не наоборот"
    "они все равно не смогут... ну типа ну фу же будет"
    "препод ему по делу сделал замечание - у дэйва не было девушки никогда, у него была дырка, сука, давалка, сосалка и так далее, какая же грязь!"
    "он ни в теории ни на практике не сможет так поступить с джеймсом"
    "это просто исключено"
    show lars normal with dissolve 
    show james smile with dissolve 
    j "в продолжение вчерашней дискуссии"
    show james normal with dissolve 
    j "если ты так хочешь про ввод информации то скажи мне - переменная которую вели куда попадёт?"
    j "в стек или кучу?"
    show dave think with dissolve 
    "дэйв выхватил у тебя электронку и собрался сделать маленькую затяжку"
    "похоже, мыслительный процесс у мастейна запускался лишь при наличие продолговатого предмета во рту"
    "хэтфилд погрозил твоему другу пальцем, а рыжий в ответ выпустил пар в воздух"
    d "смотря где и как произошла аллокация"
    d "переменная живущая в функции и создаваемая путем stdin попадает в стек и живёт там пока выполняется функция"
    d "глобальная же остаётся в куче"
    show james smile with dissolve 
    j "красавчик) си это база"
    j "а про питон что скажешь?"
    d "там нет стека и все работает через кучу"
    d "sosal?"
    show james sad with dissolve 
    j "сам сосал там в стеке ссылки на объекты а в куче они сами"
    show james normal with dissolve 
    show dave angry with dissolve 
    d "что за срань почему там нет нормального стека"
    j "это не срань"
    j "да и ребятам рано такое знать - только запутаем всех а ясности не внесем"
    j "хочешь после уроков побеседуем на эту тему"
    show dave sad with dissolve 
    d "да ну вас у меня есть чем заняться"
    show lars smile with dissolve 
    "дэйв - вот, кто настоящий бро"
    "у тебя был самый лучший кент на свете, который ни на кого тебя не променяет"
    j "ну как знаешь"
    "дэйв приставил пальцы к глазам и направил на хэтфилда, мол, ещё поговорим"
    show dave think with dissolve 
    j "советую тебе подольше посидеть на стаковерфло перед нашей дискуссией и прочитать что-то кроме рэпа на камеру иначе я тебя уделаю"
    d "штаны себе не уделайте я вам ещё покажу настоящий олдскул"
    show lars normal with dissolve 
    "ты выдохнул с облегчением"
    "интерес дэйв питал к уже по праву твоему хэтфилду чисто профессиональный - они обсуждали лютую задротскую ересь, а не подкатывали друг к другу"
    l "пипец вы очкозавры"
    menu:
        "так интересно!":
            jump intkirk
        "ну и зануды":
            jump zanud
label zanud:
    "ты демонстративно зевнул"
    show james sad with dissolve 
    j "тебе правда не интересно?"
    $james_rel -= 1
    show lars sad with dissolve 
    l "я пока не определился"
    l "мне вообще ничего не понятно и по жизни и тут"
    j "думаю если мы не будем сбиваться с маршрута и проходить темы строго по графику"
    show james normal with dissolve 
    j "то ты вольешься в процесс и всё те понравится"
    j "не переживай я позабочусь чтобы тебе было интересно"
    "дэйв ухмыльнулся непонятно зачем"
    j "всё, отвлеклись и ладно, новая тема"
    jump novtem
label intkirk:
    "ты хотел стать таким же"
    "обсуждать непонятную другим абстрактную чушь и торчать от этого"
    k "слушай а мне тоже интересно"
    $kirk_rel += 1
    k "формат конечно странный но годноту обсуждают"
    l "есть такое"
    k "мистер хэтфилд а посоветуйте книги чтобы мы тоже поняли о чем вы говорите"
    show james smile with dissolve 
    "ну не настолько же ты четырёхглазый"
    j "давайте все же азы вначале разберём чтобы была база"
    l "я за"
    d "пфффф"
    "ты надул губы в ответ и посмотрел на хэтфилда"
    "тот опять улыбнулся тебе"
    "да нет у него планов на дэйва, и у дэйва нет (оооочень уж ты надеялся!!), джеймс просто добряк и со всеми так общается"
    "а не значит ли это, что и к тебе он так просто потому что..."
    "нет нет это ты исправишь!"
    "всё, пора переходить к учёбе"
    jump novtem
label novtem:
    "джеймс осмотрел аудиторию, как тебе показалось, немного задержав на тебе взгляд"
    j "переменные мы прошли и это действительно нам необходимо"
    j "у переменной бывает имя тип размер и значение"
    j "например"
    nvl clear 
    board 'student = "Lars"'
    "ты довольно кивнул, увидев, что именно о тебе хэтфилд подумал в первую очередь"
    show dave angry with dissolve 
    d "а почему он студент а не я?"
    show james smile with dissolve 
    j "наберись терпения и тоже станешь"
    show dave sad with dissolve 
    show james normal with dissolve 
    j "так вот дэйв меня опередил"
    board 'student2 = "Dave"'
    board 'student3 = "Kirk"'
    j "и это совершенно неудобно - переменные имеют общее между собой а мы это общее игнорируем"
    j "мы не можем обратиться ко всем студентам и если у нас студентов целый Китай то просто задолбаемся писать эту цифру в имени переменной"
    j "а смотрите как удобнее"
    "дэйв зевнул"
    board 'students = \["Lars", "Dave", "Kirk", "Nick"\]'
    l "а что за квадратные скобки?"
    show james smile with dissolve 
    j "это означает что мы положили наши переменные в контейнер"
    show james normal with dissolve 
    j "в python контейнер это list или список"
    j "однако концепция контейнера есть во всех языках её придумали ещё когда я в яйцах у бати сидел"
    k "а если мне нужен все-таки один студент? как обратиться?"
    show dave think with dissolve 
    d "есть ли ограничения по размеру такого контейнера?"
    "ты решал, стоит ли закидывать джеймса вопросами"
    "в целом, ему нравится, надо что-то надумать"
    l "а если мне тяжело найти на клаве квадратные скобки могу ли я писать круглые?"
    show dave angry with dissolve
    d "а мне твое имя сложно писать по порядку давай теперь ты будешь не ларс а срал все равно суть та же"
    show lars please with dissolve
    l "лол это другое"
    show james sad with dissolve
    j "извини ларс но твой друг прав"
    show lars sad with dissolve
    show dave smile with dissolve
    "дэйв оскалил зубы, на секунду блеснув зеленой снюсиной под верхней губой"
    show dave think with dissolve
    show james normal with dissolve
    j "оператор в математике знаешь что такое а ларс"
    show lars normal with dissolve
    menu:
        "ну плюс минус там":
            jump goodans
        "ну число которое складывают умножают и тд да?":
            jump badans
label goodans:
    show james smile with dissolve
    j "чётко ответил"
    $james_rel += 0.25
    show james normal with dissolve
    j "так вот оператор это не только плюс минус там а в программировании еще и скобки и точки и двоеточия"
    j "так что если ты напишешь не ту скобку просто потому что тебе удобно то это равносильно тому чтобы написать не плюс а минус"
    j "суть выражения сразу меняется согласен ведь?"
    l "да да мистер хэтфилд теперь я понял"
    l "спасибо что объяснили"
    show james blush with dissolve
    j "я только рад помочь"
    show james normal with dissolve
    jump novtem2
label badans:
    show james sad with dissolve
    j "смотрю тебе не очень нравилась математика"
    l "есть такое мистер хэтфилд"
    show james normal with dissolve
    j "это база и царица всех наук"
    j "но не переживай вот правда"
    j "высока вероятность что ты просто до нее не дорос"
    show lars please with dissolve
    j "а оператор это не число а знак например умножить или вычесть"
    show lars normal with dissolve
    j "скобки тоже оператор"
    j "поменять решишь квадратные на круглые считай ты в выражении не плюс а минус написал"
    l "я понял"
    "ты был недоволен собой"
    "ну а что поделать, если тебе правда не интересна эта тупая математика?"
    jump novtem2
label novtem2:
    j "теперь на вопросы посложнее отвечу"
    "ты чувстовал себя немного понуро - чёт хуйню сморозил, а не вопрос"
    j "насчёт размера ну а ты что сам скажешь дэйв"
    show dave smile with dissolve
    d "девятнадцать"
    show james blush with dissolve
    show lars please with dissolve
    menu:
        "мистер хэтфилд вы ему не верьте он от яиц мерил а это читинг":
            jump badans2
        "ты вопрос задал чтобы хуем похвастаться?":
            jump goodans2
label badans2:
    j "мальчики блин имейте совесть"
    show james sad with dissolve
    j "такие разговоры продолжать можете c бутылкой жигулевского на лавочке во дворе"
    j "если это вам правда интереснее чем мои занятия - что ж вы парни смышленные сами в курсе куда вам тогда надо"
    $james_rel -= 1
    show lars irritated with dissolve
    l "простите пожалуйста"
    show lars normal with dissolve
    l "я больше так не буду"
    show dave sad with dissolve
    d "да"
    j "сидите хоть тише раз для вас пары это как срок мотать пофиг что делать лишь бы время шло"
    show james normal with dissolve
    jump novtem3
label goodans2:
    show dave sad with dissolve
    "если бы в этот момент эти якобы девятнадцать дэйв успел бы вывелить на стол, то от твоего вопроса тут же бы смущенно убрал волыну"
    "настолько осуждающе и с укором ты его спросил"
    d "чёрт возьми ты прав"
    d "простите пожалуйста мистер хэтфилд"
    $brain_dave += 1
    show james normal with dissolve
    j "прощу и может даже в брехню твою поверю если правильно ответишь насчёт размера уже контейнера а не что там у тебя на уме"
    show dave think with dissolve
    d "а в питоне есть int64 uint32 и тому подобные?"
    j "нет целое число int просто без ограничений"
    j "давай давай у тебя уже получается"
    "ты хотел сказать джеймсу, что пусть дэйв хоть сто раз прав будет, девятнадцати в штанах у него как ни мерь не найдется"
    "но размер целочисленных данных оказалася интереснее для обсуждения, нежели чем размер изменяющейся на 5-10 саниметров в зависимости от окружения переменной"
    "в общем, ты молча слушай"
    show dave angry with dissolve
    d "это же срань!"
    show dave think with dissolve
    d "неужели это реализовано настолько топорно?"
    d "должно быть нубы так и пользуются ай блин какой список безграничный а потом такие ооой а что комп завис может перезагрузить?"
    show james smile with dissolve
    j "ха-ха так и есть"
    j "тру питонисты пользуются библиотеками numpy cpython и ничего у них не тормозит"
    d "мда треш"
    show james normal with dissolve
    j "многое в этой жизни сделано через жопу"
    jump novtem3
label novtem3:
    show james smile with dissolve
    j "теперь вопрос который мне больше всех понравился так что студенту кто задал плюс балл сегодня"
    "мастейн фыркнул под нос"
    show james normal with dissolve
    j "данные в контейнере не имеют так такового имени но это не означает что они становятся недостижимыми"
    board 'print(students\[2\]) {color=#a3922e} #Kirk'
    j "как видите цифра внутри квадратных скобок и есть способ обращения к переменной внутри списка"
    j "внутри любого контейнера в целом"
    j "это индекс называется"
    j "и вы заметили что я обратился к третьему элементу числом два?"
    j "запомните - отчет начинается с нуля а не с единицы"
    j "вначале будете немного путаться а потом привыкнете"
    j "индекс не может быть больше списка"
    j "и да, длина - 4 а последний элемент увы только третий"
    j "дайте я вам еще покажу прикол"
    board 'print(students\[-1\]) {color=#a3922e} #последний элемент списка - Nick'
    board 'print(students\[-3\]) {color=#a3922e} #третий с конца элемент списка - Dave'
    board 'print(students\[-6\]) {color=#a3922e} #???'
    j "ларс плюс балл хочешь?"
    show dave angry with dissolve
    d "я хочу(("
    show james smile with dissolve
    j "ты и так все знаешь"
    show dave sad with dissolve
    show lars smile with dissolve
    l "хочу конечно!"
    j "ну тогда тебе вопрос с доски - что выведет последняя строчка кода?"
    $ timer_jump = 'hz4'
    $ time = 4
    $ timer_range = 4
    show screen timez
    menu:
        "ошибку":
            hide screen timez
            jump osh
        "не знаю":
            hide screen timez
            jump hz4
        "по кругу пойдет - второй элемент списка":
            hide screen timez
            jump oshbad
label osh:
    show james normal with dissolve
    j "а почему именно так сказать можешь?"
    show lars normal with dissolve
    l "потому что... ну как вы сказали про индекс"
    l "-6 это шестой с конца"
    l "а длина всего четыре"
    show james smile with dissolve
    $james_rel+=0.5
    j "во какой умница"
    j "заслужил плюс балл спору нет!"
    show james normal with dissolve
    "ты же не станешь ему говорить что далеко не за оценку стараешься на его уроках?"
    jump novtem4
label hz4:
    show lars sad with dissolve
    l "извините"
    show james normal with dissolve
    j "ну не грусти - это все равно вопрос больше на смекалку нежели на проверку знаний"
    j "в списке четыре элемента"
    j "а мы вызывали шестой пусть даже и с конца"
    j "нам вернется не элемент а ошибка"
    show lars normal with dissolve
    l "я запомню"
    j "вот и молодец"
    jump novtem4
label oshbad:
    show james normal with dissolve
    j "логика понятно но ты попался на типичную уловку"
    show lars sad with dissolve
    j "неважно с конца или начала но мы обратились к шестому элементу"
    j "а всего-то их четыре"
    j "так что кружить до бесконечности индекс не будет - выбросит ошиьку и дело с концом"
    show lars normal with dissolve 
    l "я понял"
    j "молодец давай дальше"
    jump novtem4
label novtem4:
    show james smile with dissolve 
    j "ну а это вам наверное совсем в новинку покажется"
    show james normal with dissolve 
    nvl clear
    j "во-первых мы добавим значение в наш список немного иначе"
    j "допустим мы хотим пойти в магазин и составляем список покупок чтобы понять хватит нам денег или..."
    d "или придётся натурой расплачивать"
    show james smile with dissolve 
    j "я хотел предложить грабить магазин однако раз тебе такой вариант более подходит возражать не стану"
    show james normal with dissolve
    j "проверка на самостоятельность"
    j "ларс молоко по чём в магазине берешь"
    show lars sad with dissolve
    show dave angry with dissolve
    d "он не знает"
    d "он ест только творог и тот подзалупный"
    show lars please with dissolve
    l "блин один раз я тебя не покормил и начаинается тамагочи блин таджикский"
    show lars irritated with dissolve
    l "я не знаю сколько стоит молоко потому что у меня папина кредитка и я цены не смотрю"
    show dave smile with dissolve
    d "во-во цены это для нищеёбов дело говорит"
    show dave think with dissolve
    show james smile with dissolve
    j "тогда мы затариваемся на количество а не на цену"
    show james normal with dissolve
    j "нам будет насрать сколько стоит молоко"
    show james smile with dissolve
    "хэтфилд посмотрел на тебя с улыбкой"
    j "особо одарённым плевать от коровы молоко или от быка"
    show lars smile with dissolve
    menu:
        "от быка типа ред булл? я в деле!":
            jump redbull
        "бычара вы ещё тот но мне на несквик молока нужно не меньше кружки!":
            jump bull
label bull:
    show james blush with dissolve
    j "ради тебя постараюсь хе-хе"
    l "правда?"
    show james smile with dissolve
    j "конечно)"
    j "лишь бы ты не голодал"
    $james_rel+=0.5
    show james normal with dissolve
    j "я съезжу на ферму и куплю тебе столько молока сколько захочешь"
    j "от коровы быка кого угодно!"
    show lars irritated with dissolve
    l "да я уж лучше ред булл выпью"
    "ну что за облом!"
    show lars normal with dissolve
    show james blush with dissolve
    j "была бы моя воля отучил бы тебя всю эту чепуху крашеную пить"
    show james normal with dissolve
    "была бы его воля"
    show lars smile with dissolve
    "окзаться во власти профессора хэтфилда"
    "чтобы он тобой доминировал и заставлял пить молок вместо ред булла"
    "ещё бы тебя возбудило если бы он заливал тебе молоко из шланга в срачку и приказывал так ходить, но речь, увы, совсем не об этом"
    show lars normal with dissolve
    j "ладно пей что тебе нравится а мы продолжаем"
    jump novtem5
label redbull:
    show james smile with dissolve
    j "пусть будет ред булл"
    show lars normal with dissolve
    show james normal with dissolve
    j "я бы на твоём месте пил коровье молоко"
    show lars smile with dissolve
    l "а сиськи не вырастут?"
    j "мужские тестостероновые если то да"
    show james smile with dissolve
    j "как у..."
    "ты принялся пристально разглядывать не совсем тестостероновые, но весьма заметные джеймсовые сиськи"
    show james normal with dissolve
    j "у твоего друга"
    j "такие же мышцы будут!"
    show lars sad with dissolve
    l "больно надо"
    j "ну и пей тогда свой ред булл а мы продолжаем"
    show lars normal with dissolve
    jump novtem5
label novtem5:
    j "берём мы всё-таки молоко а не ред булл за одну соточку"
    nvl clear
    board "milk = 100"
    j "ещё купим всякую чушь"
    board "pineapple = 450"
    board "cucumber = 60"
    board "shopping_cart = \[pineapple, milk, cucumber, 300, 4000, 50, 200\]"
    j "и вот мы идем с нашей корзиной к кассе и понимаем что огурец мы взяли но забыли к нему..."
    show dave smile with dissolve
    d "вазелин и гандоны"
    show james smile with dissolve
    j "лично я думал взять помидор и сделать салат однако дэйв нашёл этому овощу иное совсем применение"
    board "lubricant = 60"
    board "condoms = 500"
    board "shopping_cart.append(lubricant) {color=#a3922e} #append - метод списка (добавляет один элемент в конец)'"
    board "shopping_cart.append(condoms)"
    board "shopping cart.remove(milk) {color=#a3922e} #remove - убирает конкретный элемент из списка (элемент обязательно надо указать!)"
    d "но корзина-то ваша это вы огурец с вазелином купили"
    j "а в магазин за такими развлечениями послал меня ты и скажи спасибо что я тебе купил не баклажан"
    show dave angry with dissolve
    d "а я может баклажан хотел(("
    show james normal with dissolve
    j "на доску смотри давай баклажан"
    board "shopping_cart.append(150)"
    j "на пути к кассе мы решили взять ещё какие-то конфетки за 150"
    j "и потом сразу же осознали импульсивность нашей покупки и вернули конфетки на место"
    board "shopping_cart.pop() {color=#a3922e} #pop с пустыми скобками выбрасывает последний элемент из списка"
    board "banana = 130"
    board "shopping_cart.append(banana)"
    board 'shopping_cart.pop(-1)'
    j "поняли? remove - удалить элемент по названию или значению а pop - удалить элемент того номера который мы указали в скобках"
    j "а если скобки пустые - удаляется последний автоматически"
    j "ларс тебе скучно?"
    "ты оторвался от телефона"
    l "слушаю вас мистер хэтфилд"
    show james smile with dissolve
    j "как говорится - нет времени объяснять суй ананас в жопу"
    j "так что удали-ка ананас из нашего списка) иди давай на доске напиши)"
    show lars irritated with dissolve
    l "я доски стесняюсь"
    show james normal with dissolve
    j "штаны подтяни чтобы не спадали и стесняться будет нечего иди давай"
    show lars normal with dissolve
    l "ладно(("
    l "говорите ананас убрать..."
    menu:
        "shopping_cart.append(pineapple)":
            jump ap
        "shopping_cart.pop(0)":
            jump pop0
        "shopping_cart.pop(1)":
            jump pop2
label ap:
    show james sad with dissolve
    j "append не знаешь как переводится? английский"
    show dave angry with dissolve
    d "да это европейский педик какой там английский"
    show lars please with dissolve
    l "мастейна забыть спросили"
    show lars normal with dissolve
    l "точно, не append, а pop тогда" 
    show james normal with dissolve
    j "да, только pop принимает не имя переменной, а её порядковый номер в списке"   
    l "буду знать"
    jump zadanie
label pop0:
    show james smile with dissolve
    j "всё верно) ананас - первый а точнее нулевой элемент и мы его выбросили"
    j "молодец ты у меня"
    $james_rel += 0.5
    show lars smile with dissolve
    l "да легко все просто"
    show james normal with dissolve
    j "радуйся пока легко)))"
    "ананас в жопе легко ощущаться уж точно не будет или о чем там говорил джеймс"
    jump zadanie
label pop2:
    show james sad with dissolve
    j "а 1-то почему выбрал? pop - верное решение, но зачем тебе второй элемент?"
    show james normal with dissolve
    l "как второй? я первый выбрал... аааа блин ноль надо было"
    show james smile with dissolve
    j "ноль)))"
    show james normal with dissolve
    j "ничего страшного, ты рано или поздно привыкнешь)"
    l "буду стараться"
    jump zadanie
label zadanie:
    "джеймс еще многое объяснить успел, прежде, чем ты среагировал на его голос"
    "ну такие у тебя проблемы с концентрацией были - твоего интереса хватало максимум на тиктоковский клип, а сидеть целую пару и изучать одно и то же при всем желании не мог и всё"
    "может если бы хэтфилд сел с тобой индивидуально ты бы не лез в телефон так часто и думал больше об учёбе..."
    "хотя последнее - ой как сомнительно"
    show james normal with dissolve 
    j "напоследок дам вам задание на креативность"
    j "можно как и в парах и так в соло как волк одиночка"
    j "вам нужно создать список чего угодно"
    j  "спросить пользователя о его любимом элементе из списка"
    j "и подарить ему этот элемент"
    j "думаю тут все просто и до конца занятия успеете"
    show lars irritated with dissolve 
    l "я спать хочу он меня заебал"
    show dave angry with dissolve 
    d "а прикинь каково его тёлке или кого он трахает"
    show lars please with dissolve 
    l "компьютер он трахает"
    "ты надеялся что твои слова были правдой - отчего-то тебя расстраивала версия, что у джеймса ещё кто-то был"
    "какую бы скучную чушь он ни нёс"
    show lars normal with dissolve 
    l "давай тоже трахнем компьютер"
    show dave think with dissolve 
    d "да в пизду была бы последняя пара ещё ладно а так ну побереги силы"
    l "да ладно тебе на перемене пожрем покурим силы появятся"
    "дэйв лениво поелозил компьютерной мышью - вы сидели за учебным компьютером вдвоём и уныло пялились на открытый там редактор кода"
    d "а что вообще делать будем?"
    menu:
        "давай справимся побыстрее а остаток пары по шпаку вкинем и поспим":
            jump shpak
        "давай разъебем всех своей программой - напишем лютую дичь чтобы заданию соответствовало а содержание заставило всех охуеть":
            jump dich
label shpak:
    show dave angry with dissolve 
    d "да я шпак и так могу вкинуть"
    show dave sad with dissolve 
    d "я думал у тебя идея какая-то гениальная будет а так на отъебись я и сам могу"
    show lars please with dissolve
    l "ну блин"
    show dave angry with dissolve 
    d "я уже понял что твой котелок что-то креативное при всем желании никак не сварит"
    show lars irritated with dissolve
    l "иди нахуй мой котелок хотя бы варит сам а не как игровой автомат - пока насвай не вкинешь как монетку шоу не начнётся"
    show lars normal with dissolve
    l "я сейчас сам все сделаю а ты сиди и жди свою монетку"
    show dave think with dissolve 
    d "ну сделай мне вообще похуй"
    show dave smile with dissolve 
    d "сделай мой игровой автомат тебе из другого места приз выдаст"
    show dave think with dissolve 
    show lars please with dissolve 
    l "боюсь твой приз через ладошки утечёт я-то помню как ты протеина наелся и устроил блин пауэршитинг в моем толчке"
    show dave angry with dissolve 
    "лучше обосраться с протеина и пердеть с бцаа чем не срать вообще с твоей диеты из мармелада и скиттлс ауф"
    "проходящий мимо джеймс усмехнулся мудрому высказыванию"
    j "не спорь ты с ним иди лучше к кому-то без пары сядь и сделай задание"
    l "а я сам сейчас сделаю!!"
    show lars normal with dissolve 
    "джеймс пожал плечами а твой кореш пофигистично качнулся на стуле"
    "ты же подул губами на чёлку, делая характерное такое пффф"
    "что там джеймс говорил - спросить пользователя о любимом элементе?"
    "допустим элементом будут цвета..."
    "красный белый жёлтый"
    "нет хуйня унылая"
    "шмотки"
    "штаны юбка трусы носки"
    'input "что хотите надеть?"'
    "ты замер"
    "а как дальше-то?"
    "все печатают что-то, дэйв лыбится как пидорас довольный, что делать-то?"
    "ты открыл телефон чтобы загуглить ответ"
    "сайт с программированием оказался уныло раскрашенным в оранжевый форумом и ты скоропостижно отвлёкся на тикитоки всякие лишь бы эту скуку не видеть"
    "твой телефон время от времени вибрировал - скучающий дэйв тебе тоже слал всякую чушь смешную, и ты даже не хотел интересоваться, притронулся ли он к заданию"
    show james sad with dissolve 
    j "ларс ты бы хоть попытался"
    show lars sad with dissolve 
    l "простите меня"
    show james normal with dissolve 
    j "да мне-то что твои же знания"
    show lars normal with dissolve 
    "мне сложно сосредоточиться тут так шумно ещё и дэйв мемы шлёт"
    "хэтфилд положил тебе ладонь на плечо, и ты удивлённо, но с наслаждением принялся запоминать ощущение тепла его пальцев"
    show james smile with dissolve 
    j "это всё фигня"
    show james normal with dissolve 
    j "если сильно захотеть можно в космос полететь"
    j "просто оффни весь мир и работай если тебе действительно это хочется"
    show lars smile with dissolve 
    l "я правда попробую профессор"
    show lars normal with dissolve 
    j "я в тебя верю"
    jump paraend
label dich:
    d "тогда сначала надо выбрать по какой теме будет дичь"
    show dave smile with dissolve
    d "а давай... давай кракен сделаем"
    show lars please with dissolve
    l "ага блин на бутылку чур ты садишься кракен блин он хочет"
    show dave think with dissolve
    d "давай тогда табачку со снюсом и дудками"
    show lars smile with dissolve
    l "у тебя есть хорошие мысли в голове"
    l "цветочный магазин ресторан дом"
    show dave smile with dissolve
    d "дом! давай публичный дом пж пж пж"
    d "с блекджеком и шлюхами!"
    l "бля а давай))"
    show lars normal with dissolve
    l "можно сделать список из сексов там анал минет 69 куни"
    show dave angry with dissolve
    d "фу бля без куни только бабские угоды нахуй сразу"
    show lars smile with dissolve
    l "ясно ясно тебе только крепкую елду с венами подавай"
    l "давай тогда пользователю предлагают выбрать число и ему дается секс такого индекса какое число он взял"
    show dave think with dissolve
    d "давай еще имена добавим"
    show lars normal with dissolve
    l "как ты это видишь?"
    d "смотри - вот у нас сексы"
    "дэйв взглянул на доску и принялся печатать в редакторе кода"
    nvl clear
    computer "name1 = input('имя кого-то крутого:)"
    computer "name2 = input('ваше имя:')"
    d "понял что будет щас?"
    l "эээээ..."
    show dave angry with dissolve
    d "ну ты и дятел"
    show dave think with dissolve
    d "я создал две переменные - имя1 и имя2 и каждой присвоил значение вводимое пользователем"
    d "теперь давай напишем чем они будут заниматься"
    d "сечёшь?"
    show lars smile with dissolve
    l "а то))"
    computer 'sex = ["анал", "минет", "69", "проникновение с игрушкой", "золотой дождь", "голландский штурвал", "римминг", "фистинг"]'
    show dave smile with dissolve
    d "блять дрочил бы ты меньше даже я такой арсенал так с ходу не перечислю"
    show lars normal with dissolve
    show dave think with dissolve
    d "напиши как индекс выбрать мне просто интересно ты хоть что-то понял"
    show lars smile with dissolve
    l 'ну.... index = input("число от 1 до 8:)'
    l "верно?"
    computer 'index = input(f"число от 1 до \{len(sex)\})'
    l "len чё такое"
    show dave angry with dissolve
    d "блять твоё сдвг меня уже доебало ты пока мух считал хэтфилд это рассказать успел len - функция длины списка"
    show dave think with dissolve
    computer 'print(f"\{name1\} и \{name2\} страстно практикуют \{sex.pop(index-1)\}")'
    d "минус один потому что..."
    show lars please with dissolve
    l "счёт начинается с нуля а мы числа с единицы просим я понял уже"
    show lars normal with dissolve
    l "а почему pop вот это лучше объясни"
    d "pop вовзращает значение то есть можно переменной присвоить что-то методом pop"
    d "то есть не просто выбросить элемент а еще и дальше им пользоваться"
    l "понял!"
    d "вот и красава пошли хэтфилда звать"
    show dave smile with dissolve
    nvl clear
    hide screen nvl
    "дэйв запустил код, и черный экран консоли закрыл собой вашу писанину"
    d "мистер хэтфилд идите к нам мы первые справились у нас такая программа получилась"
    show dave think with dissolve
    show james smile with dissolve
    j "ну показывайте ребят)"
    show james normal with dissolve
    computer_print "имя кого-то крутого:"
    j "имя кого-то крутого?"
    show james smile with dissolve
    j "чья идея была кто крутой?"
    show lars smile with dissolve
    l "я я я!!"
    "джеймс улыбнулся и напечатал твое имя"
    computer_print "Ларс"
    show james normal with dissolve
    computer_print "ваше имя:"
    j "так теперь мое?"
    "и тут до тебя дошло!!!"
    show dave smile with dissolve
    show lars sad with dissolve
    l "нет мистер хэтфилд не вводите своё имя пожалуйста"
    "дэйв лыбился - код-то не был виден, один лишь экран"
    show james normal with dissolve
    j "а что такого?"
    d "да он ссыт просто вводите спокойно"
    l "нееееет((("
    "джеймс конечно же послушал не тебя, напечатал имя и нажал enter"
    computer_print "Джеймс"
    show lars normal with dissolve
    "пофиг. ты решил держать морду кирпичом"
    computer_print "число от 1 до 8:"
    j "число? давай 8"
    "ты припоминал, что там было, и лучше тебе не становилось"
    show james blush with dissolve
    computer_print "Ларс и Джеймс страстно практикуют фистинг"
    show lars sad with dissolve
    j "а что не указал кто кого?"
    j "или мы это на су-е-фа скидываемся?"
    show james smile with dissolve
    j "только камень не показывай а то я за сигнал к действию приму"
    "ты поражался тому, как хэтфилд спокойно реагировал на весь пиздец, что генерировал мастейн вокруг себя, а ты ему сопуствовал в этом"
    show lars smile with dissolve
    l "есть видосы где знак бумаги тоже за сигнал считается"
    show james blush with dissolve
    j "я бы тебе интернет отключил честное слово"
    show dave think with dissolve
    d "а оценка нам за наш шедевр будет?"
    show james normal with dissolve
    j "будем)) постарались ведь"
    $brain_lars += 1
    $will += 1
    j "пойду дальше у ребят проверять"
    j "уверен вас уже не переплюнуть"
    hide screen nvl
    nvl clear
    "дэйв закрыл консоль, и на экране снова высветился твой список с извращениями"
    j "даже не сомневаюсь"
    jump paraend
label paraend:
    j "вы все большие молодцы"
    show james smile with dissolve 
    j "первая сложная тема а вели себя достойно будущим специалистам"
    j "всем кто заслужил баллы за работу я поставил"
    show nick sad with dissolve 
    n "а что всё уже?"
    show james normal with dissolve 
    j "ну у вас как я понял дальше высшая математика идёт"
    show james smile with dissolve 
    j "а я второму курсу буду мозги штурмовать))"
    show lars sad with dissolve 
    l "как математика?("
    "тебя мало того, что напугало, что она высшая, так ещё и после этой пары уже хотелось ну не этим заниматься"
    "кушать и спаньки"
    "вот это вот хотелось, а не цифры всякие считать"
    "а нужно ли вообще ходить на математику?"
    show lars normal with dissolve 
    menu:
        "эй дэйв а нахуя нам математика?":
            jump palec
        "мистер хэтфилд а зачем нам нужна математика?":
            jump neuro
label palec:
    show dave angry with dissolve 
    d "чтобы когда пальцами в жопе ковыряться будешь посчитать мог их количество"
    show dave sad with dissolve 
    d "тебе-то она точно не пригодится"
    show dave think with dissolve 
    show lars please with dissolve 
    l "а тебе?"
    d "а мне что"
    "ну ты всё понял"
    "дэйв устал и капризничал"
    "он конечно приходил в ярость, когда такое говорил, но а что делать, если это было так?"
    "солевое бешенство сажало нервную систему как надо"
    "да и, честно говоря, ты бы и сам уже с удовольствием с пар свалил"
    show lars smile with dissolve 
    l "да не кипятись ты мы сейчас на машинке твоей поедем кататься нахуй эту муть"
    show dave smile with dissolve 
    d "машинкой тебя бы постричь под 3 миллиметра и с автоматом заставить год побегать а это автомобиль мой конь железный"
    show lars normal with dissolve 
    l "а я скажу что я гей"
    show dave think with dissolve 
    d "да и ты молча об этом заявлять умудряешься"
    d "чё страшно стало?)"
    show lars please with dissolve 
    l "иди нахуй пожалуйста"
    show james normal with dissolve 
    j "удачного дня ребята"
    show james normal at move_x (1.2)
    show lars normal with dissolve 
    l "пойдём блин пока перемена не кончилась"
    d "да да по съебам"
    d "эй нектарин ты с нами?"
    show nick smile with dissolve 
    n "да ну вас мне матеша для карьеры ещё нужна"
    show dave sad with dissolve 
    d "я с вас всех хуею"
    "дэйв не то радовался за ника, не то осуждал тебя - ты частенько его не понимал, и сделать с этим ничего не мог"
    show dave think with dissolve 
    d "до завтра"
    show dave think at move_x (-1)
    show lars normal at move_x (-1)
    scene corvette with dissolve 
    show day_sun zorder 10
    show dave think at move_x_from (-1, 0.9)
    show lars normal at move_x_from (-1.2, 0.75)
    "долгое время вы молча курили и пялились на тачку"
    "вам даже стало неловко сосать чапман свой вонючий в присутствии сиреневой красотки"
    "обворожительная, сексуальная крошка так и манила взгляд как и тебя, совсем не разбирающегося в авто, так и более продвинутого друга"
    "ты ведь правда считал, что гелик это круто и понты"
    "вот вплоть до момента как увидел это чудо"
    "у дэйва вообще чуть ли не стоял на тачку"
    d "как думаешь чья?"
    show lars smile with dissolve 
    l "мне похуй чья я бы дал владельцу в салоне его американистой детки"
    d "и я если честно"
    show dave smile with dissolve 
    d "пусть меня хоть в три погибели ебёт лишь бы дал прокатиться разок на его корветте 58 года"
    "вы услышали как кто-то приближался быстрым шагом к вам и фиолетовой деточке, позвякивая ключами от автомобиля"
    "такими вот старыми ключами, не ключ-картой, а ну прям ключи-ключи"
    show james normal at move_x_from (2, 0.3)
    "ну неудивительно на самом деле"
    "тебе даже жалко его стало - сейчас пройдёт мимо этой секс-бомбы к какой-то ржавой ниве рядом или что там открывается такими ключами"
    j "привет мальчики а чего не на занятиях("
    show lars normal with dissolve 
    l "да мы это курим просто"
    show lars smile with dissolve
    l "вы лучше посмотрите какая красотка"
    l "я готов бросить учёбу и сосать круглые сутки только лишь бы в салоне этой железной нимфы"
    show dave sad with dissolve 
    d "а я готов очко продать тому кто даст на ней хоть разок по шоссе проехаться"
    show james smile with dissolve 
    j "мальчики слово ведь не воробей)"
    show lars normal with dissolve 
    l "а что тут такого) если вас этот секс на четырёх колёсах не возбуждает..."
    show james normal with dissolve 
    j "возбуждает ещё как) не переживай"
    "джеймс подошёл близко-близко к машине - ты удивился, откуда у него столько смелости приблизиться к столь прекрасному творению американских мастеров..."
    "...привычным и непринужденным движением открыл дверь, порылся в бардачке с целью вытащить какую-то флешку и осторожно закрыл машину обратно"
    show james smile with dissolve 
    j "за руль не пущу но подвезти могу вообще за просто так"
    show james blush with dissolve
    j "но раз вы предложили такое..."
    show james normal with dissolve
    "прежде чем ты обкончал себе трусы от переизбытка фантазии, джеймс сделал серьёзное и даже строгое лицо"
    j "я пошутил"
    show james sad with dissolve 
    j "вы бы лучше об учёбе думали я-то знаю что прогулять решили"
    $james_rel-=1
    show james normal with dissolve 
    j "мне пора) берегите себя"
    show james normal at move_x (-0.5)
    show dave think with dissolve 
    d "ну что берёшь слова обратно сосать он там хотел"
    show lars smile with dissolve 
    l "вообще-то не беру"
    show dave sad with dissolve 
    d "так и знал"
    show dave think with dissolve 
    d "пидорас пидорас пидорасина"
    "ты не стал спорить с дэйвом и акцентировать внимание на том, что он с целью сесть за руль джеймсовой тачки был готов жопу свою поставить, не зная, кто владелец"
    "ты же все равно собирался сделать то же самое"
    "вы задумчиво посмотрели в романтично блестящие стеклянные глаза фиолетового корветта и пошли садиться в мастейновскую ладу ебаную"
    "хотели в магазин - надо ехать"
    jump afterpara
label neuro:
    show james smile with dissolve 
    j "да знаешь у неё столько применений"
    j "вы же блогеры да?"
    show lars smile with dissolve 
    l "я контент мейкер"
    show lars normal with dissolve 
    l "сам он свои шесть кубиков в кроп-топе с блёстками сфоткать не сможет"
    show james normal with dissolve 
    j "а знал ли ты что когда ты исправляешь на фотографиях свет в фотошопе то там проходят огромные математические исчисления?"
    "ты зевнул - тебе было насрать"
    show dave think with dissolve 
    d "это какие"
    show james smile with dissolve 
    j "ну помнишь я вкратце сказал что списки бывают двумерными трёхмерными и так далее?"
    "ты этого вообще не помнил - ты снова упрекнул себя в своей невнимательности"
    "а что поделать, если пока джеймс рассказывал про многомерные списки, ты решил для ассоциации повоображать?"
    "сначала ты представил одномерный список - 1d линию, цепочку из шариков, ожерелье, анальные бусы... стоп, что?"
    "а всё, точка невозврата пройдена - пока хэтфилд объяснял про 2d, 3d списки, в твоей голове он по одному элементу засосывал 1d список в твою задницу, и эти элементы с каждым разом все увеличивались в значении"
    "а как дэйв тебя разбудил от своей сладкодрочной дрёмы, вы уже проходили другую подтему"
    d "помню я ещё вас спрашивал а в чем суть"
    j "ага) я тебе спойлерить много не буду но пиксель это массив 4×1 а картинка 800 на 600 пикселей ну сам понимаешь"
    "дэйв задумался"
    d "а если я кисточкой белой как устроил кримпай на весь холст ну типа подрисовал на фотке полный рот кончи какому-то полупокеру?"
    show james smile with dissolve 
    j "то пиксель белого цвета умножается на пиксель уже имеющийся на фото"
    show james normal with dissolve 
    j "число 4×1 умножается на такое же число и учти там не просто сумма там свои приколы"
    show lars please with dissolve 
    l "бля вы хоть на перемене это не обсуждайте"
    show dave angry with dissolve 
    d "срал я на перемену пошли на математику мне интересно"
    "тебе казалось что дэйву вообще не было дело до каких-то пикселей и чисел-списком, но чем-то его джеймс смог внезапно так заинтересовать"
    show james smile with dissolve 
    j "это я ещё тебе про машинное обучение не сказал"
    show dave smile with dissolve 
    d "я тот еще шумахер если вы про это"
    j "смотри резину не сотри"
    show dave think with dissolve 
    show james normal with dissolve 
    j "мне пора - у меня такое чувство что я в флешку в тачке забыл"
    j "а вам уже давно пора в другой кабинет"
    "чем-то недовольный, ты поплёлся за дэйвом"
    scene math_bg
    show electric zorder 10
    show jason normal
    show kirk normal at right
    show nick normal at my_right 
    show lars normal at move_x_from (-1, 0.2)
    show dave think at move_x_from (-1.2, 0.3)
    "сонные и уставшие, вы завалились в уже занятый студентами класс"
    show dave angry with dissolve 
    d "это чё за квадробер"
    n "тссс это препод"
    show dave think with dissolve 
    d "а что он мне сделает? коготочками поцарапает"
    show lars smile with dissolve
    l "в тапки нассыт и новогоднюю ёлку перевернёт"
    js "давайте начнём занятие"
    show jason blush with dissolve 
    js "и простите меня за мой внешний вид"
    show jason normal with dissolve 
    js "я джейсон json jasonic жи ес - как хотите называйте в общем веду у вас все математическое"
    js "высшую математику дискретку теорию вероятности и численные методы"
    "мастейн легонько пихнул тебя локтем"
    "ты понял, что тот собрался очередное фрик-шоу выродить и принялся записывать кружочек"
    show dave angry with dissolve 
    d "эй котик а если не секрет зачем извиняться за такой прикид раз ты по жизни так ходишь"
    show jason blush with dissolve 
    js "да не хожу я так по жизни!"
    js "мы с джеймсом... ну с хэтфилдом короче вы его знаете уже играли в шахматы на желания и я проиграл"
    l "а если бы джеймс сказал голым прийти и вы бы проиграли?"
    "джейсон покраснел ещё сильнее и зажмурился от стыда"
    "дэйв показал жестом, что с бедолаги было достаточно, и ты выключил камеру"
    l "ладно не очкуйте я бы за вас вступился и мы бы вместе профессора хэтфилда уделали"
    show jason normal with dissolve 
    js "ты попробуй его уделать) гроссмейстер ещё тот"
    js "я вижу что на его паре вы проходили что-то важное и уже ушатались но пожалуйста напрягитесь ещё чуть-чуть иначе будет пробел в образовательном процессе"
    show lars please with dissolve 
    "ты пообещал себе спросить, в какие же ещё игры на спор играл джеймс с этой своей недокошкоженой"
    show lars normal with dissolve 
    "тебе почему-то казалось, что котик был кастрирован"
    "иначе выражаясь, ничего с джеймсом у него быть не могло, просто хэтфилд товарищем был юморным и мог просто прикалываться над молодым коллегой"
    "но убедиться все же стоило"
    "вдруг перед тобой стоял твой будущий конкурент"
    "в шахматы на желания играли, говорил он?"
    "да ты при желании такой chess in ass устроишь, пофиг, что играл ты плохо - если бы джеймс помещал все съеденные фигуры тебе в очко, у тебя бы все равно осталось бы немного места"
    "а пока ты снова залипал на очередное извращение с джеймсом в главной роли, кошкомальчик уже во всю что-то вещал про какие-то странные числа под названием матрицы"
    js "ну вы представьте себе эксель таблицу"
    js "вот в матрице как в эксель таблице есть строка и столбец"
    board "1 0 0\n0 1 0\n0 0 1"
    js "вот единичная матрица и её диагональ"
    "ты снова прикрыл глаза"
    "тебе совсем было не до этой хуйни"
    "ты прослушал слишком много, чтобы быстро навёрстывать"
    "а дэйв сидел с лицом директора кирпичного завода и слушал"
    "он кстати умел иногда так"
    "вкалывать не сомнительную химозу, откопанную на детской площадке, а вкалывать в плане трудиться работать батрачить"
    "а ты уже во всю клевал носом"
    hide screen nvl
    nvl clear
    menu:
        "(взять вейп и отпроситься в туалет)":
            jump vape
        "(терпеть, пытаться не спать)":
            jump rubit
label vape:
    "засыпая и зевая на ходу, ты достал из рюкзака вейп и сунул его в карман своей худи"
    l "я отойду?"
    js "конечно только ненадолго"
    show lars normal at move_x (-1)
    scene college_corridor with dissolve 
    show electric zorder 10
    show lars normal 
    "прямо в коридоре ты сделал плотную тяжечку свежей жижки и вернулся в кабинет хоть более-менее бодрым"
    scene math_bg
    show electric zorder 10
    show jason normal
    show kirk normal at right
    show nick normal at my_right 
    show lars normal at move_x_from (-1, 0.2)
    show dave think at left
    js "транспонировать это означает поменять местами строки и столбцы ну как будто наклонить матрицу вбок"
    "ты потихоньку вникал в материал"
    $will+=1
    "даже хорошо, что ты отпросился"
    "хотя бы мозги встали на место"
    js "дайте я вам покажу как это выглядит"
    "ты устало кивнул и принялся записывать"
    jump laraend
label rubit:
    "ты протёр глаза и сел ровнее, слушая лютую дичь, что нёс этот квадробер"
    "вот бы ему просто звук оффнуть"
    "как аудиодорожки в звукозаписывающей студии"
    "так одну, которая за его голос отвечает, просто в ноль выкрутить и весело будет"
    "будет рот как рыбка открывать, а звука не слышно, ха-ха"
    "рыбка"
    "интересно, а джеймс ходит на рыбалку?"
    "рыбалка... карасики... водка..."
    show lars sad with dissolve 
    "джеймс..."
    "ты внезапно подскочил и открыл глаза"
    jump laraend
    label laraend:
    js "домашнее задание я выложил в журнал"
    "ты поверить не мог"
    "пара закончилась"
    show james normal at move_x_from (2, 0.35)
    j "ой а чей это котик ребят признавайтесь"
    j "отлично выглядишь ньюкид"
    show jason blush with dissolve 
    js "я ньюстед и то что я тут недолго работаю не повод меня так называть"
    show james smile with dissolve 
    j "да ладно тебе хвост опусти коготочки всунь обратно я же по-доброму"
    show jason normal with dissolve 
    js "ага ты у нас тут сама флаттершай"
    j "ты лучше побудь послушным котиком и выйди из моего аккаунта на компе а то мне лень через весь кабинет идти"
    js "ходить вообще-то полезно тебе уж точно"
    "ты хихикнул - похоже, не только ты и дэйв из самых дружеских побуждений издевались друг над другом"
    show james normal with dissolve 
    j "ты это болтай давай болтай а я-то помню что тебя ждёт в воскресенье"
    "ты тут же подскочил"
    show jason blush with dissolve 
    show lars please with dissolve 
    menu:
        "вы встречаетесь?":
            jump vstr
        "вы соревнуетесь?":
            jump sorev
label sorev:
    show james smile with dissolve 
    j "ха-ха у нас такая заруба"
    j "json знаешь как штангу жмёт?"
    j "целый крымский мост из позвоночника выстроит тужится пыжится а сотка его давит))"
    j "пауэрлифтинг зато это называет прикинь"
    show james normal with dissolve 
    jump laraend2
label vstr:
    show james sad with dissolve 
    j "он-то ладно я чем на пидора похож?"
    js "как минимум желаниями которые ты мне в нашей зарубе постоянно загадываешь"
    show james normal with dissolve 
    j "нет ларс не говори глупостей"
    $james_rel-=0.5
    j "json мой бро для меня его срачка зашита"
    show james smile with dissolve 
    j "мне насрать кому там он её подставляет"
    "джейсон совсем опустил глаза"
    "видимо, ему было не слишком комфортно в таком формате общаться, но сказать он никак не решался"
    show james normal with dissolve 
    j "но в воскресенье тебя конечно то ещё псковское порно ты никак не сольешься ни сдристнешь"
    show jason normal with dissolve 
    js "ага смотри не пёрни в процессе"
    js "я кмс в своей весовой взял пускай и с моста а ты на своей массе далеко не уедешь"
    jump laraend2
label laraend2:
    "речь шла про качалку"
    "кончалку"
    "тебе сразу перестало быть интересно"
    "дэйв, от усталости находящийся в какой-то трансе, разом раздуплился, лишь бы вставить свои пять копеек"
    show dave smile with dissolve 
    d "а профессор хэтфилд тоже с моста жмёт? и сколько кмс в вашей весовой а джейсон?"
    show dave think with dissolve 
    show james smile with dissolve 
    j "да я и без моста стольник жму на разы"
    show lars smile with dissolve 
    l "вы такой сильный"
    js "чемпион по поеданию бургеров"
    l "а в чем толк кубиков пресса если бабы не дадут все равно"
    show lars normal with dissolve 
    "ты зачем-то встал на защиту хэтфилда, однако тот чего-то даже расстроился с твоих слов"
    show james sad with dissolve 
    j "да они и такому мне дадут если распиздеться суть-то не в бабах"
    show james normal with dissolve
    d "пивной живот для мужика честь а пресс и у пидора есть"
    "а вот дэйву джеймс улыбнулся"
    show james smile with dissolve 
    j "отличный пресс кстати"
    "дэйв собирался что-то ответить, но не успел"
    j "а теперь все дружно повалили к выходу всем ясно?"
    j "домой хочу а мне ещё ужин готовить"
    js "конечно тебе ещё ужин готовить ты пока три порции не съешь спать не ляжешь"
    "джеймс устало махнул рукой и пошёл к выходу"
    scene corvette
    show sunset zorder 10
    show james normal at move_x_from (-1, 0.8)
    show lars normal at move_x_from (-1, 0.5)
    show dave think at move_x_from (-1, 0.3)
    "джейсон отсоединился от вас по дороге и ушёл к автобусам как нищеёб"
    "а вы же пошли к парковке"
    "шли к мастейновской девятке а джеймс - к своей ниве или что там вообще у него может быть"
    "не велосипед уж точно"
    "и шли вы, к слову, мимо уж очень красивой машины!"
    show lars smile with dissolve 
    l "какая же тачка сексуальная хотел бы я чтобы меня ебали в ней в три погибели!"
    l "просто красотка секс-бомба а не машина чья бы она не была я хочу чтобы этот чувак стал моим папиком"
    show dave smile with dissolve 
    d "даже угонять такое чудо жалко это же раритет и произведение искусства"
    show dave think with dissolve 
    d "ничто не сравнится с моей тюнингованной скромницей однако под этот капот я бы тоже заглянул"
    "ты не стал комментировать, что эта самая скромница выдавала тот ещё рёв двигателя по ночам и скрип шин, пока дэйв учился дрифтить во твоём, сука, дворе"
    "тебе вообще было срать на машину дэйва и что тот изменять собрался своей девятке с корветтом... черт возьми, все бы изменили девятке с корветтом, если бы возникла необходимость ебать автомобили"
    l "если бы владелец этой крохи стоял передо мной я бы ну сделал бы ему всё что он пожелает лишь бы прокатил меня по трассе"
    "джеймс смотрел на вас с многозначительной улыбкой, перебирая между пальцами ключи от автомобиля"
    "ключи старые, прям как у дэйва от девятки, даже старше - не ключ-карта, а именно ключи"
    show james smile with dissolve 
    j "я желаю чтобы вы мальчики приехали по домам вовремя и выспались а покатать..."
    "джеймс приблизился к ухоженной намытой машине и открыл дверь ключом, демонстрируя кожаный салон в стиле ретро"
    j "вижу вы уже на транспорте приехали так что в другой раз"
    show james sad with dissolve 
    j "и не надо мне никакую мерзость предлагать вообще исключите эту дурь у себя из головы"
    "тебя так и подумывало оставить дэйва наедине с его ебаной девяткой и поехать домой к джеймсику на его сиреневом чуде"
    "но какой ты после этого был друг?"
    show lars normal with dissolve 
    l "у вас ну очень крутая машина"
    l "но мы сегодня поедем на своей"
    show dave think with dissolve 
    d "я вами восхищаюсь"
    j "эта машина многого мне стоила"
    show james normal with dissolve 
    j "однако я ни о чем не жалею!"
    show james smile with dissolve 
    j "счастливого пути мальчики"
    show james normal with dissolve 
    j "будьте осторожны на дороге"
    scene parking2
    show sunset zorder 10
    show lars normal 
    show dave think at my_left 
    l "а я даже зная что машина хэтфилда дал бы ему лишь бы он меня на ней до дома подвез"
    show dave angry with dissolve 
    d "то что ты бы ему дал это и так за версту видно"
    "ой, правда? ты палишься походу"
    show dave think with dissolve
    d "но знаешь я от него такого не ожидал"
    d "крутой мужик"
    "в это время джеймс проехал мимо вас и помахал рукой"
    jump afterpara
label afterpara:
    scene hyper_veg
    show hyper_light zorder 10
    show dave think at move_x_from (-1, 0.5)
    show lars normal at move_x_from(-1, 0.3)
    "взяв огромную магазинную коляску (точь-в-точь как те, на которых вы катались пьяные в школьные годы), вы двинулись к овощному отделу"
    "ты ощущал себя настолько уставшим, что в голове все ещё звенел фонк, который вы слушали по дороге в магазин, а перед глазами все ещё блистал начищенный фиолетовый корветт джеймса"
    d "морковку ты мытую покупаешь чтобы в месте назначения одна земля с другой не мешалась?"
    show lars please with dissolve 
    l "я не люблю мыть овощи грязь под ногти попадает"
    show dave angry with dissolve 
    l "если тебе так надо возьму морковь немытую"
    d "да ну её земля это для нищеёбов"
    "дэйв обожал это слово, а ты ненавидел, когда он так говорил - вообще не определить, что у него в этот момент было на уме"
    "ты знал, что дэйва только его блог и кормил - в отличие от тебя, рыжего никто не финансировал и справлялся он сам насколько мог"
    "и вот эти все брендовые тряпки и понты вешались вечером в обшарпанные стены съёмной старой квартиры в пятиэтажке, куда тебе даже заходить было противно, вдруг ведь на таракана наступишь"
    "а тут - нищеёбы, а кто нищеёб - вообще вопрос на миллион"
    d "зачем тебе вообще морковь"
    show lars normal with dissolve 
    l "салатик хочется"
    l "а слушай в пизду тут смотри какая резаная готовая есть"
    "ты положил уже взвешенный пакет обратно на кучу овощей, не удосужившись высыпать товар, и взял с полки фасованные дольки в пластиковой упаковке"
    show dave sad with dissolve
    "больше овощей вы брать не стали и пошли к фруктам"
    scene hyper_veg
    show hyper_light zorder 10
    show dave angry at move_x_from (-1, 0.5)
    show lars normal at move_x_from(-1, 0.3)
    l "чё мина такая кислая"
    d "да я стейк хотел купить или шашылк а вижу ты сейчас всё бабло на брокколи и спаржу въебешь и будем мы как кролики траву эту жрать"
    show lars smile with dissolve 
    l "анекдот про нефтяника в ресторане с палачом знаешь?"
    show dave think with dissolve 
    d "соси давай денег ещё дохуя?"
    l "намёк понял?"
    show lars please with dissolve 
    l "только стейк я все равно не возьму - красное мясо я не ем а ты готовить не умеешь кухню мне к чертям собачьим спалишь"
    show dave sad with dissolve 
    d "вообще без мяса меня оставить решил?"
    d "ты понимаешь что тогда моё тело словит катаболизм а мышцы сгорят к ебеням и буду я не такой секси((((((("
    "дэйв сделал грустные глаза и заговорил люто плаксивым, противным и скулящим голосом"
    show lars smile with dissolve 
    l "блин ладно не хочу я чтобы мой друг был не секси пошли протеин купим"
    show dave think with dissolve 
    d "умеешь же ты конечно нормальное дело в гей-порно превратить"
    show lars please with dissolve 
    l "молчи лучше а то протеин тебе соевый куплю"
    show dave smile at move_x_from (0.5, -1.0)
    "оставив тележку с продуктами стоять в стороне, дэйв метнулся кабанчиком в соседний отдел, где стоял всякий спортпит"
    "выбрав себе протеин с нейтральным вкусом (какой-то распиздатый изолят, но ты не шарил), он отнёс его в тележку"
    show dave smile at move_x_from (-1.0, 0.5)
    "держа камеру в одной руке, твой друг нахваливал огромную банку"
    d "мнение дорогие подписчики"
    show dave sad with dissolve 
    d "чего? хуй стоять не будет?"
    d "да на что ему стоять они мохи вокруг"
    show dave think with dissolve 
    d "а ты что думаешь а?"
    show lars smile with dissolve 
    l "то что у тебя жопа от такой банки треснет"
    d "так порошок мне а банка - тебе это у тебя треснет лол"
    l "я имею в виду куда тебе килограмм а не то что у тебя на уме овулятор комнатный"
    show dave angry with dissolve 
    d "это у тебя дневная доза белка чуть меньше чем с хуя накапает а я машина мне нужно топливо!"
    show lars please with dissolve 
    l "перфоратор ты с дилдо на кончике пошли купим фрукты"
    show dave smile with dissolve 
    d "манго?"
    show lars smile with dissolve 
    l "а давай манго)"
    l "давай ещё киви ананас персики клубники из пендостана импортной ещё бахнем"
    show dave think with dissolve 
    d "щедро ты"
    d "кого-то угостить собрался?"
    menu:
        "хэтфилда": 
            jump givehet
        "сам сожру вкусно же пиздец":
            jump giveme
label giveme:
    show dave sad with dissolve 
    d "а мне?"
    l "рука в говне))"
    show lars normal with dissolve 
    l "шучу бро я что свинья столько сожрать вместе схаваем"
    l "ты хоть фрукты ешь или тебе под плюхой всё равно чем пузо набивать?" 
    show dave think with dissolve
    d "пузо это у твоего питониста у меня slay prime era кубики и талия аномалия"
    show dave smile with dissolve
    d "это же клубника её надо есть аккуратно и медленно оттопыривая мизинчик нахуй"
    show lars smile with dissolve
    l "ага леди когда сосёте мне не чавкайте соблюдайте этикет"
    show dave think with dissolve
    d "бери тогда побольше пока магазин не закрылся"
    l "очко у тебя после такого не закроется дристать будешь так что за километр будет видно ты ж ещё и протеин взял ебана в рот"
    show dave angry with dissolve
    d "иди нахуй"
    $dave_rel += 1
    "дэйв выглядел довольным - вечно голодный бедолага с жадностью смотрел на клубнику и по-собственнически крепко держал в руках огромную банку протеина"
    "просерина"
    "ей богу, пердеть со своего белкового хрючева будет так, что находящийся в комнате ноутбук заново себе винду переустановит"
    "ну пожрёт зато хотя бы"
    "нехер кента голодным оставлять - рофлы рофлами, а для братана ты готов был сделать многое"
    jump homeev
label givehet:
    show dave angry with dissolve
    d "бери тогда сразу ящик"
    d "хрен ты его одной клубничкой накормишь"
    show lars please with dissolve
    "ты закатил глаза и нахватал ещё лотков с ягодами, предварительно убедившись, что продаваны не подсунули тебе гниль и прочее свинство"
    d "да куда столько"
    show lars smile with dissolve
    l "не только же хэтфилд любит пожрать есть тут ещё один кадр"
    l "напялит своё ветмо лимитед эдишн и весь воротник засрёт ягодным соком хоть слюнявчик надевай"
    show dave blush with dissolve
    d "такое было лишь один раз я аккуратно ем"
    l "я тебя буду с рук кормить чтобы ты потом не ныл что клубника с бархата не отстирается"
    show dave think with dissolve
    d "хоть в очко себе эту клубнику засунь и по одной мне выплёвывай спасибо на самом деле что угощаешь"
    show lars normal with dissolve
    l "а джеймса таким же образом накормить или не оценит?"
    show dave sad with dissolve 
    d "всё ты о нем да хорош уже твой джеймс хоть из тазика жрать будет по нему видно"
    show lars please with dissolve
    l "я так-то и тебя угощаю базар фильтруй"
    show dave think with dissolve
    d "по факту"
    $dave_rel += 0.5
    show lars normal with dissolve
    l "джеймс будет есть так как я решу ясно"
    d "да ты зассышь ему просто предложить знаю тебя"
    "ты задумался"
    "да, шутить можно и про тазик, и про плевки ягодами из очка, да про что угодно, но вот просто подойти к нему перед парой и отдать контейнер с фруктовым салатом - ой бля, очково это"
    "но ты обязательно справишься!"
    "люди не умеют читать мысли - пока ты сам не намекнёшь джеймсу, он сам и не догонит, что у тебя на уме"
    "а ты ведь намекнёшь"
    "инфасотка"
    show lars smile with dissolve
    l "бибу соси возьму и сделаю"
    show dave smile with dissolve
    d "посмотрю я на это"
    $give_james_treat = True
    "захватив ещё и сливки из баллончика (чтобы жопа слиплась, а разлепить её можно было, засунув этот самый баллончик), вы двинулись к кассам"
    jump homeev
label homeev:
    scene kitchen evening
    show lars normal at move_x_from (-0.3, 0.6)
    show dave think at move_x_from (-0.5, 0.3)
    l "наконец дома!"
    d "второй учебный день а ты уже в зюзю что за дела"
    show lars smile with dissolve
    l "в зюзю мы ещё пока не успели чего ж ты"
    show dave smile with dissolve
    d "а предлагаешь?"
    show lars normal with dissolve
    l "у тебя есть?"
    d "спрашиваешь?"
    "ты был не против сделать пару тяжечек из бутылочки с пластилином, вот честно"
    "день как-то тяжко прошёл, ты хотел спать весь день, а ведь завтра ещё вставать надо было снова на учёбу"
    "хотя бы на хэтфилда посмотреть можно, не ставили бы с ним пары почти каждый день, ты бы давно уже записался в прогульщики"
    "впрочем, сейчас ты думал лишь о том, что наконец-то оказался дома и до полуночи мог спокойно бездельничать или заниматься всяким асмр лоу-эффорт релаксом"
    show dave think with dissolve
    d "ты не засыпай только"
    d "может сначала фрукты нарежем?"
    "ты пригласительным жестом указал на ножи и продолжил сидеть на стуле, потягивая подик"
    "дэйв вооружился небольшим, но острым ножом и поднёс лезвие к запястью"
    "ты включил камеру - снимать кружки никогда не напрягало тебя, да и контент он как говно, литься должен постоянно при любых обстоятельствах"
    show dave angry with dissolve
    d "я такой психопат блин клас"
    "дэйв подкинул в воздух клубнику и на удивление почти попал, отрезав часть от красной ягоды"
    show lars please with dissolve
    l "охуел продукты переводить"
    show dave think with dissolve
    d "а кто сказал что перевожу"
    "он тут же поднял с пола отрезанный кусок и, согласно правилу пяти секунд, с довольным лицом съел"
    show dave smile with dissolve 
    d "ммм клубничка песня"
    d "у нас сегодня витаминный детокс мы собрались нюхать кокс"
    show lars smile with dissolve
    l "тебе только на клей хватит"
    d "клей это для миллениалов нах надо мы жрать дорогие подписчики жрать ягоды и протеин а вы дальше ешьте свой роллтон с майонезом"
    "дэйв взял из шкафа с посудой дуршлаг и принялся мыть ягоды"
    "ты снял обилие всего купленного и пару раз своего рыжего друга, не переставая посасывать свою электронку"
    "он умело орудовал ножом, да и в целом был вовсе не рукожопом - вскоре все ягоды были очищены от плодоножек, манго и прочие крупные фрукты нарезаны"
    show dave think with dissolve
    d "сливки тащи ща тебе такой кримпай устрою"
    "ты метнулся за сладким кремом в баллончике - не успел ты и глазом моргнуть, как педантичный аккуратист дэйв разложил на редкость эстетичную композицию и украсил десерт сливками"
    d "сделаешь пару кадров пока я нам дунуть забью?"
    show lars smile with dissolve
    l "ты прикалываешься какое дунуть"
    l "такую красоту нахуячил мне аж жрать жалко"
    d "да мне похуй красиво нет я хочу чтобы меня размазало пока я хаваю"
    show lars please with dissolve
    l "я уже говорил что главный твой хейтер это ты сам?"
    show lars normal with dissolve
    "впрочем ты всё равно метнулся за оставленной на балконе бутылкой, не забыв сделать несколько красивых фотографий десерта"
    show lars smile at move_x (1.2)
    show night_light_pink
    show lars normal at move_x (0.6)
    l "это что за интим такой?"
    d "ты в курсе что в твоей ленте на потолке светодиоды управляются через внешний код?"
    show lars please with dissolve
    l "какие идиоты?"
    show dave sad with dissolve
    d "свет твой может быть хоть синий хоть розовый у тебя умный дом вообще-то есть"
    show lars normal with dissolve
    l "не знал вообще"
    l "а светлые идиоты что делают"
    d "светодиоды преобразуют ток в освещение учи матчасть"
    show lars please with dissolve 
    l "блин не начинай нам завтра ещё целые две пары эту муть слушать"
    show dave angry with dissolve
    d "а мне вот интересно"
    show dave think with dissolve
    d "он тебе ещё будет про си плюс плюс рассказывать перед трахом иначе у него не встанет"
    show lars smile with dissolve
    l "звучит весьма секси"
    d "да я лучше в жопу дам чем в си плюс плюс полезу"
    "вы стукнулись кулачками в знак согласия"
    "у вас действительно был тот ещё коннект - ты подумал, что пора бы уже начать своё поступление на факультет плюхендуй, и дэйв молча положил смачную пластилинку на сигарету, чтобы потом засунуть её в дырку в боку пустой литрушки"
    "ты представил, как джеймс делится с тобой принципами программирования на си плюс плюс, из чего бы они там не состояли, что-то занудное тебе рассказывает"
    show smoke
    "ты втянул дым и подержал во рту, смакуя"
    "а джеймс все рассказывает, и так он погружен в этот процесс, что не замечает, что в спальне уже давно темно, ты уже голый лежишь на кровати, он сидит рядом, ему не до тебя..."
    "ты гладишь его по коленке и поднимаешься все выше, чтобы забрать у него телефон с открытой вкладкой какого-то сайта с кодом"
    show smoke
    "глоток сладкого дыма из наполненной этим дымом бутылки"
    "дотронулся до его бедра, так ну прям сжал, благо, есть, что у него посжимать и потискать"
    "положил руку на ремень его штанов"
    "джеймс обернулся, как-то виновато посмотрел на тебя"
    "что-то влажное коснулось твоих губ... стоп, что?!"
    "ты открыл глаза"
    "дэйв, умиротворенно и невинно улыбаясь, тыкал в твоё лицо янтарно-жёлтым манго с белым цветком сливочного крема на верхушке"
    show dave smile with dissolve
    d "братан ты купил просто охуеееенные фрукты"
    show lars normal with dissolve
    "украшенный обрамлением от эффекта плюхи, вкус манго раскрылся на полную у тебя во рту"
    l "ой правда"
    l "а о чем я думал?"
    show dave think with dissolve
    d "а я как угадать должен?"
    show lars smile with dissolve
    menu:
        "о джеймсе":
            jump nophoto
        "похуй":
            jump fruitphoto
label no_photo:
    show dave sad with dissolve
    d "бля оно и понятно что о нём"
    d "иди спать ложись меня не грузи своей педерастией"
    show dave think with dissolve
    d "если тебя так прёт вздрочни давай перед сном"
    d "не при мне только прошу"
    "дэйв не хотел портить тебе настроение и ценил вашу дружбу"
    "но было заметна, как его задело отсутствие внимания к его персоне, в словах звучала ревность"
    show lars normal with dissolve
    l "ты тоже тогда ложись"
    d "да погоди ты я читаю про динамическую память"
    "нелепо давя лыбу, дэйв повернул к тебе телефон с научной статьёй"
    "ты быстро включил камеру"
    show lars smile with dissolve
    l "про какую память говоришь читаешь?"
    d "про динамическую а точнее про std контейнеры без фиксированного размера типа vector или list в этом ваше python"
    l "понятно"
    l "а плюху дунул зачем?"
    "ты приблизил и снял слегка покрасневшие полузакрытые карие глаза друга"
    show dave smile with dissolve
    d "а без плюхи я такую хуйню читать не стану"
    l "вот он секрет успеха программиста поняли?"
    show dave sad with dissolve
    d "иди спать"
    d "я главу дочитаю и лягу на диване"
    "ты схватил клубнику с блюдца и с удовольствием прожевал сочную ягоду" 
    d "зубы бля только почисть мне после тебя вейп брать мерзко с утра"
    "ты показал другу фак и удалился в закат, неуверенно шагая путающимися друг о друга ногами"
    "а хэтфилд тебя бы на руках отнёс"
    "как точно подметил дэйв, рассказывая по пути про свой код"
    "а потом положил бы на кровать"
    "сказал бы что-то типа теперь проверим насколько твой массив динамический"
    "вам бы потребовалось много, очень много вазелина"
    "ты ускорил шаг, стремясь быстрее оказаться в спальне"
    "у тебя опять встал"
    jump fruitmorning
label fruitphoto:
    d "а это нормально"
    d "мысля под напасом долго не живёт"
    d "иди фрукты поешь они правда крутецкие"
    "ты с удовольствием стащил с блюда идеально квадратную дольку киви, покрытую сливками"
    l "заебца"
    "кажется до этого ты думал о джеймсе"
    "неудивительно"
    "продолжать ты все же не будешь - вряд ли дэйв такому шибко обрадуется"
    "лучше уж другу время уделить"
    show lars normal with dissolve 
    l "а что читаешь?"
    d "да так статью про динамическую память контейнеры всякие std"
    l "sexual transferred diseases?"
    d "ну типа"
    "дэйв отложил телефон и потянулся за ложкой "
    "ты открыл рот, чтобы фруктовый салат достался тебе"
    "ягоды и так были безумно вкусные, а под травой и вовсе от одного их сладкого аромата улететь хотелось"
    "ты зачерпнул салат сам и протянул ложку дэйву"
    l "блин ты так эстетично хаваешь дай тебя сфоткаю"
    "дэйв тут же взбодрился - любил он, когда внимание доставалось именно его персоне"
    "сделав пару снимков, ты снова взял себе немного салата"
    "дэйв устало зевнул, с трудом концентрируясь на статье"
    l "может на боковую?"
    show dave sad with dissolve 
    d "ладно завтра дочитаю"
    show dave think with dissolve 
    "мастейн оперативно завернул в пленку блюдо с десертом и убрал в холодильник"
    scene larsroom with dissolve 
    show nighter zorder 10
    show dave think at move_x_from (-0.6, 0.3)
    show lars normal at move_x_from (-0.3, 0.6)
    "ты порылся в карманах в поисках дудки - хотелось побыстрее перебить ядрёный вкус фторидовой зубной пасты"
    l "курилку не видел?"
    "сидевший на кровати дэйв пошарил руками по кровати, своей одежде и под конец, под подушкой"
    show lars sad with dissolve 
    l "нет нет нет туда не лезь прошу"
    show dave angry with dissolve 
    d "блять тебе интернет надо нахуй отключить родительский контроль поставить и ислам принять чтобы молиться при мысли о таком хараме"
    "под приподнятой другом подушкой хранился целый... бля да даже думать стыдно, что там хранилось"
    show lars please with dissolve 
    l "иди нахуй моя жопа что хочу то и делаю"
    show dave think with dissolve 
    d "как она ещё с таким арсеналом говно в себе держит"
    l "ебучку завали нормально держит в отличие от твоей"
    "ты прикрыл руками красные щёки"
    show dave smile with dissolve 
    d "в отличие от моей? да когда до хэтфилда дойдут твои намёки он там в ладоши сможет похлопать"
    show lars normal with dissolve 
    l "почему в ладоши? типа молодец я?"
    d "ага блин молодец лидирующий разработчик"
    "из-за плюхи информация доходила долго, но в итоге до мыслительного центра всё же добралась"
    show lars please with dissolve 
    l "иди нахуй ему понравится"
    d "да там звук будет как если ложкой в спагетти повозюкать"
    show lars smile with dissolve 
    l "могу с уверенностью сказать что хлюпанье бывает если много смазки налить"
    "ты почесал подбородок"
    "приятная тебе тема нехило так расшевелила твои мозги - дэйв же, напротив, о чем-то задумался"
    l "много обычно льют когда намечаются большие планы"
    "большие, как рука джеймса"
    "блин, да это тебе нехило так придётся расслабиться"
    "возможно, одной рукой ты будешь держать джеймса за руку"
    "пока вторая его рука..."
    "нет, наверное и за руку держать не будешь - скорее всего, чтобы тв привык, он сначала разомнёт тебя двумя пальцами обоих рук"
    "ты видел такое часто"
    "интересно, больно оно вообще или возбуждение перекроет всю боль, а под мягким голосом джеймса ты и вовсе растаешь и все тебе будет под силу - и два пальца, и четыре, и кисть..."
    show dave angry with dissolve 
    d "сука пистолет свой на меня не направляй"
    d "миниган блин"
    show lars please with dissolve 
    l "он с тех подрос сильнее чем ты можешь представить"
    show dave think with dissolve 
    d "я не как ты любитель представлять такое"
    "дэйв снова открыл в телефоне свое укуренное чтиво"
    d "я спать и тебе советую того же"
    show lars normal with dissolve 
    l "спокойной ночи бро"
    l "извини меня"
    "дэйв удивлённо посмотрел тебе в глаза"
    show dave blush with dissolve 
    d "извини?"
    show lars smile with dissolve 
    l "если травмировал твою монашескую психику девственника"
    "дэйв, к слову, занюхнул дорогу прямо со сраки стриптизерши, было дело"
    show dave think with dissolve 
    d "зато у меня жопа целая иди нахуй маппет тряпичный"
    show dave think at move_x(1.2)
    "когда до тебя дошло, дэйв уже покинул комнату"
    "плюха всё ещё держала свой эффект"
    "на чем ты остановился?"
    "джеймс своим сексуальным мягким низким голосом приказывает тебе расслабиться, а сам плавно вводит в твою обильно смазанную лубрикантом задницу по два пальца каждой руки и начинает тянуть в разные стороны"
    "ты, к слову, лежишь на животе, на его коленях и кверху своей ненасытной, готовой быть растянутой жопой"
    "а он сидит на кровати, вытянув ноги и локтем придерживает тебя за поясницу, чтобы ты не смог если что выбраться"
    "ты сделал плотную затяжку вейпа и сжал покрепче свой миниган в ладони"
    "воображаемый хэтфилд предупредил тебя, что сначала будет тяжело, но когда она войдет по костяшки, должно стать привычнее"
    jump glava3