label chapter4:
    # scene kitchen
    # $ current_light.value = "pink_nightlight"


    $ current_light.value = "pink_nightlight"
    scene larsroom pink_nightlight
    $ renpy.show_layer_at([fever_dream_mild], layer='master')
    show screen wake_up
    show lars test at center
    "спал ты на редкость беспокойно - по ощущениям прошло часа как максимум два или три (окна ты завешивал плотным блэкаут шторами для вайба)"
    "однако одиннадцать утра на телефонных часах заявляли об обратном"
    $ current_light.value = "pink"
    "свет ударил в глаза - едва ты встал с кровати, то чуть не грохнулся"
    $ renpy.show_layer_at([fever_dream_severe], layer='master')
    "ты проспал учёбу?"
    "и пару джеймса проспал, и с батей не пересекся?"
    "а... ты что-то начал вспоминать"
    "судя по истории вызовов, в семь утра вы даже общались... о чем?"
    l "ах да, он говорил, что ты перепутал семь утра с семью вечера и что приедет он как раз именно под вечер"
    "ещё в истории звонков оказался пропущенный вызов - ровно такой же оставшийся без внимания, как и будильник"
    l "чето хуевит меня(( лягу обратно :("
    show screen fighting_sleep_success
    "несмотря на ближущееся к обеду время, тебя клонило в сон"
    "ты собрался убрать телефон в сторону и дальше валяться в плену неведения и какой-то очень противной простуды, как телефон начал издавать гудки"
    "ты автоматически ткнул на пропущенный!"
    "кто вообще тебе мог звонить после разговора с отцом?"
    "ты глянул, куда вообще шёл вызов и едва до тебя дошла критичность ситуации, как трубку подняли"
    show screen facetime("james normal" , "classroom")
    j "ларс? молодец что дождался перемены"
    "перемены? ты потерял счёт времени"
    "джеймс поставил телефон на стол и что-то читал в компьютере"
    "черт, ты ещё и по фейстайму позвонил"
    "ты хоть сам цивильно выглядишь? вроде в одежде, но лицо... как после ночи со смачным таким кристаллом мефа"
    j "так что случилось у тебя(( вчера не написал что дошёл а утром на пары не явился - я же переживаю"
    l "так я в полном... "
    show screen apchi
    l "апчхи! в порядке я(( не переживайте пожалуйста профессор хэтфилд"
    "джеймс покачал головой"
    j "врача вызывал?"
    l "а мне батя заказал курьера с лекарствами"
    l "ну базовый набор - а как приедет то вызовем"
    j "это скоро?"
    l "в семь вечера примерно) а что?"
    show james smile with dissolve
    j "да тут такая идея пришла..."
    "ты придвинул телефон поближе, заинтересованный идеей, и смутил этим джеймса"
    show james blush with dissolve
    j "сегодня тему проходили важную и я бы не хотел чтобы ты пропустил ее"
    j "если у тебя будут силы на это..."
    show james normal with dissolve
    "у тебя силы не хватало даже самую крошечную анальную пробку в очко принять, настолько все тело ломит - какие же планы были у препода на тебя?"
    j "у меня мало пар в этот день - в три часа я тебе позвоню опять и покажу что мы прошли"
    "вот ведь садист - у тебя температура не меньше 38, мышцы ноют и голова раскалывается, а он ещё решил в эту твою голову знания пихать!"
    show lars smile with dissolve
    l "вы зря думаете что я пойму хоть что-то по телефону"
    l "когда у меня были репетиторы то они приходили ко мне домой - иначе как горох о стену"
    show james blush with dissolve
    "ой, как его щеки покраснели! туда, туда, закапываем!"
    l "придёте объяснять?"
    "он даже возразить теперь не сможет, уфф, ну и гений же ты"
    "затащил жигули в квартиру, зачем только?"
    show james normal with dissolve
    j "знаешь а ведь приду) обязательно выспись - тема не из лёгких"
    "ага, джеймсик тоже не из лёгких, но ниче, кровать твоя выдержит, как и ты все, что он захочет с тобой сделать, как окажется в твоём доме"