label glava3:
    $persistent.progress = "2"
    scene black with dissolve
    show text "{color=#e67bbd}глава 3\n[chapters[2][0]]{/color}" with Pause(1.5)
    scene black with dissolve
    scene college with dissolve
    show electric zorder 10
    show james normal at my-right
    show lars normal at move_x_from (-0.3, 0.5)
    show dave think at move_x_from(-0.6, 0.2)
    "в аудиторию вы пришли одни из первых"
    "завтракали вы фруктовым салатом - было настолько вкусно, что жалко было перебивать этот вкус сигой или подиком"
    "профессор хэтфилд сидел и что-то сосредоточенно читал в телефоне"
    "ты ощущал значительный диссонанс"
    "сбоку ты видел, что препод читал форум по программированию"
    "да и в целом выглядел на редкость мирно и невинно"
    "а ты вчера на него дрочил"
    "долго и в извращенной форме"
    "как вспомнишь, чтобы там нафантазировал..."
    "а он ведь простой мужик без всякого стремления к подобным девиациям"
    "рукава у него на рубашке закатаны, чтобы не мешать печатать, а не показать, насколько глубоко..."
    "так, стоп!"
    l "мистер хэтфилд а что читаете?"
    j "решение проблемы ищу"
    j "про алгоритмы обучения модели"
    j "что-то я сделал не так - датасет у меня хороший а выходная точность невелика"
    l "а что такое датасет?"
    show james smile with dissolve
    j "а давай попозже объясню?"
    show james normal with dissolve
    j "пока что тебе рано - только лишний раз собьёшься с пути"
    l "ладно да"
    if give_james_treat:
        "ты неуверенно посматривал на рюкзак с контейнером салата для джеймса и никак не решался озвучить свою уже почти доведенную до конца идею"
        "дэйв стоял и молча пялился на тебя - ты представил, как рыжий подонок будет злорадствовать, когда твои яйца не окажутся слишком жёсткими для такого шага"
        "но ты все равно не мог двинуться с места"
        j "эй ларс у тебя все хорошо?"
        show lars sad with dissolve
        l "с чего вы такое спрашиваете (((("
        show james smile with dissolve
        j "да стоишь ты так мнёшься будто тебе отлить надо а я не разрешаю"
        "ебучий джеймс, перестань давать поводы для генерации извращенной чепухи у тебя в голове!"
        "нет, когда ты будешь промывать очко перед сексом, он не заставит тебя залить туда побольше воды и терпеть"
        "ну нет, нельзя о таком думать, так и всю жизнь продрочишь"
        show dave smile with dissolve
        d "не переживайте за такое он нефор и если что в штаны нассыт"
        "джеймс усмехнулся и с неожиданно тёплой заботой посмотрел на тебя"
        show james normal with dissolve
        j "так что у тебя случилось?"
        show lars normal with dissolve
        l "я вам кое-что принёс думал вам понравится и отдать стесняюсь"
        "джеймс окончательно отвлёкся от форума с кодом и положил тебе руку на плечо"
        j "ну всё отступать поздно был анонс давай и релиз"
        "ты метнулся к рюкзаку, неловко зацепившись за что-то на столе"
        j "ну не суетись ты так всё хорошо"
        show lars sad with dissolve
        l "я знаю мне просто ужасно неловко"
        show lars normal with dissolve
        l "мы с дэйвом отмечали начало учебного года"
        "хэтфилд смотрел на тебя своими голубыми глазами, как тебе казалось, с застывшей в них уснувшей мечтой"
        l "мы приготовили просто лакшери фруктовый салат и я решил вас тоже угостить"
        show lars sad with dissolve
        l "не считайте пожалуйста что я как-то к вам подлизываюсь я просто хочу..."
        "ты замолчал, не найдя подходящего завершения фразы"
        "бля что ты хотел просто?"
        "чтобы как в поговорке отсосу за колбасу??"
        show james smile with dissolve
        j "дружить?"
        show lars smile with dissolve
        l "да да точно"
        "друзей же можно представлять в таких сценах, как это делаешь ты?"
        show james normal with dissolve
        j "тебе хоть скучно со мной дружить не будет?"
        j "я застал 2007 и гонял на скейте лохматый"
        l "вы интересный вообще-то"
        show james blush with dissolve
        l "если вы не против конечно"
        show james normal with dissolve
        "джеймс улыбнулся тебе и осмотрел контейнер" 
        j "не против конечно"
        j "вот это да ты мне столько принёс"
        $james_rel += 1
        j "спасибо большое"
        "ты сел на место, совсем довольный и весёлый"
        show dave sad with dissolve 
        "дэйв отчего-то не разделял твоих эмоций"
        show lars normal with dissolve
        l "ну чё киснешь хорошо же всё"
        d "забей"
        show dave think with dissolve
        "ты не успел расспросить друга (тут уж точно друга, без подтекста в виде адской жопоебли), так как прозвенел звонок"
        "в аудиторию сразу ввалилась куча инцестных абортышей и ник с кирком (они ещё норм были), а при толпе дэйв точно ныть не планировал"
        jump lesson3
    else:
        "ты ещё раз виновато заглянул в экран его телефона и сел на место"
        "всё же стоило угостить его этой кримпай клубникой"
        "дэйв печально пялился в свой телефон и что-то настолько отстраненно печатал, будто ему было вообще насрать на содержимое своего сообщения"
        l "бро о чем грустишь"
        d "да скучно мне и всё"
        show james smile with dissolve 
        j "скучно? давай сюда свой аккаунт я тебе статей накидаю"
        show dave smile with dissolve
        d "да ну вас у меня сообщения платные сотку звезд одно стоит у вас столько нет"
        show dave think with dissolve 
        d "да и акк вам палить как-то очково если честно" 
        show james normal with dissolve
        j "тогда поднимай свой сервак с jabber клиентом и sqlite как минимум а лучше с mysql будет у тебя приватка что хочешь то и пиши только дрянь всякую не скидывай прошу"
        "ты тут же навострил уши"
        l "что за приватка? что за дрянь?"
        d "ну если уж я не понял ничего ты точно такой сервер не поднимешь сиди манку ешь тугосерик пеленочный"
        "ты ткнул дэйва в плечо"
        "срать на всю эту безопасность в интернете и прочую чепуху, ты хотел приватку хэтфилда"
        show james smile with dissolve
        j "вам обоим ещё срать и срать до такого сервера так что не ругайтесь"
        j "я все обязательно покажу только позже"
        show james normal with dissolve
        j "ребята вот пришли давайте дальше учиться"
        jump lesson3
label lesson3:
    "джеймс осмотрел уже не такую пустую аудиторию и встал, собравшись начать пару"
    "что-то даже открыл, а потом ему позвонили, и, как видимо, кто-то значимый настолько, что он аж переменился в лице и поскорее свалил"
    show james sad at move_x (1.2)
    l "че с ним"
    d "с кем?"
    "дэйв вытащил из рюкзака контейнер с фруктовым салатом и благополучно съебался к нику"
    show lars please with dissolve 
    l "а че не угостил хэтфилда"
    show dave angry with dissolve
    d "хуетфилда"
    show dave think with dissolve
    show lars normal with dissolve
    "поняв, что большего от дэйва не дождёшься, ты стал гадать, кто же позвонил джеймсу"
    "наверное, стоит просто спросить"
    d "жри или чего я тебя кормить должен"
    n "да я просто стесняюсь соррян бро ща быстро схаваю все"
    show dave angry with dissolve
    d "это тебе не пельмени на скорость жрать ты смаковать каждый кусок должен ясно?"
    show nick sad with dissolve
    n "бро ну дай я тебя взамен тоже чем-то угощу что ж ты меня как содержанку"
    show dave think with dissolve
    d "у меня такой фетиш"
    "дэйв высунул язык, собираясь показать, какой он фетишист ебанутый, а ник вместо того, чтобы отшатнуться в ужасе, достал из шайбы свежую снюсину и живо залепил её на десну мастейну"
    d "ммм вкусный у тебя снюс"
    show dave smile with dissolve
    d "хорошая реакция"
    show nick smile with dissolve
    n "я же на велике гоняю с хуя ей быть плохой"
    n "кстати отличные фрукты я никогда такой манго не пробовал"
    show dave think with dissolve
    d "ешь пока база кормит"
    "тут дверь открылась и вошёл хэтфилд с донельзя понурым ебалом"
    show james sad at move_x (0.5)
    "он устало смотрел в пол, крепко держал телефон в руке и будто бы совсем не придавал значения тому, где сейчас находился"
    menu:
        "вы в порядке?":
            jump jamesgood
        "кто вам звонил?":
            jump jamesbad
        "а что сегодня будем проходить?":
            jump jamesneutral
label jamesgood:
    show james smile with dissolve
    j "не переживай не растаю не сахарный"
    j "просто по работе..."
    show james sad with dissolve
    j "а ладно черт с тобой человек один близкий позвонил"
    menu:
        "насколько близкий?":
            jump jamesbad2
        "нормально поговорили?":
            jump jamesgood2
label jamesbad2:
    "джеймс удивлённо поднял бровь"
    $jamesrel -= 1
    j "достаточно"
    j "не хватало ещё тебе моё нытье слушать"
    show lars please with dissolve
    l "а если мне интересно"
    j "посмотри дом-2 ей богу"
    show james normal with dissolve 
    j "закроем эту тему"
    show lars normal with dissolve
    l "простите пожалуйста"
    "ты быстренько сделал выводы"
    "с телкой посрался, что тут гадать"
    "жаль, конечно, что она у него есть, это он занят, получается"
    "но с другой стороны, раз отношения шаткие..."
    "надо как-то его на этот разговор пробить как-то"
    "наверное, при ребятах стесняется, вот и не вышло"
    jump lesson3continue
label jamesgood2:
    show james smile with dissolve
    "джеймс улыбнулся, все ещё нервно сдавливая телефон в ладони"
    show james normal with dissolve 
    j "лучше тебя в это не втягивать"
    j "обыкновенная мелодрама"
    show james sad with dissolve
    l "но вы же переживаете"
    l "не обязательно рассказывать можно попробовать отвлечься"
    show james smile with dissolve 
    $jamesrel += 1
    j "спасибо тебе"
    show james normal with dissolve
    j "да"
    j "ты прав ларс давай отвлечемся"
    "джеймс тепло посмотрел в твои глаза, а ты неловко улыбнулся"
    "с бабой какой-то поругался, спору нет"
    "непонятно правда до сих пор, кто она ему"
    "тебе бы тоже не помешало отвлечься"
    "пусть сам скажет, нечего его пытать"
    jump lesson3continue
label jamesbad:
    "джеймс совсем помрачнел и спрятал телефон в карман"
    $jamesrel -= 1
    j "поверь не так важно как тема нашего урока"
    "ты закатил глаза"
    "так просто информацию из него не выудить, а ведь звонила-то баба инфасотка"
    "когда джеймс поднял трубку, ты слышал гневные интонации, произнесенные женским голосом, но не разобрал сказанного, да и хэтфилд быстро свалил за дверь"
    "однако в том настроении, чтобы спокойно за бутылкой лимонного гаражика рассказать про эту суку, а потом дать себя пьяного выебать, он совсем не пребывал, к твоему сожалению"
    "и вместо этого тебе придётся опять сидеть на учёбе и учиться, ебать эти знания в рот и хэтфилда туда же"
    jump lesson3continue
label jamesneutral:
    show james normal with dissolve 
    "джеймс чуть-чуть взбодрился от твоих слов и неловко улыбнулся, поправляя очки"
    j "узнаешь сейчас"
    show james smile with dissolve 
    j "поверь будет интересно"
    show james normal with dissolve 
    j "ты уж извини что отвлёкся"
    l "да ладно вам вы же не на час ушли"
    j "ты молодец что на учёбе концентрируешься"
    show james smile with dissolve 
    j "постараешься так всю пару?"
    "тебе уже становилось скучно - джеймс не собирался делиться с тобой слезливой историей про звонившую ему (ты слышал женский голос на конце трубы) суку"
    "а тебе ну очень хотелось знать что за марамойка ему смела нервы трепать"
    show lars smile with dissolve 
    l "конечно мистер хэтфилд я буду стараться"
    show james normal with dissolve
    j "тогда приступим"
    "джеймс сказал бы это и перед тем, как привязать тебя к кровати с раздвинутыми ногами, надеть перчатки и..."
    "концентрация, концентрация, точно"
    jump lesson3continue
label lesson3continue:
    "джеймс написал название на доске и слова на английском языке рядом"
    board "if elif else" 
    board "while condition:"
    board "for item of collection"
    board "for variable in range (start, stop, step):"
    j "ребят будет сложно - нам объединили две темы так что сидим слушаем внимательно" 
    j "в программировании есть циклы"
    j "мы повторяем выполнение одного и того же кода несколько раз и это ну очень хорошая тема когда требуется много или неизвестно сколько повторений"
    j "вот я например приду в качалку жать какой-то лёгкий вес скажем семьдесят килограмм"
    "ты сразу представил это дело"
    "пару раз ты страховал на жиме дэйва - вставал над ним и снимал кружочки, пока тот пыхтел под штангой"
    "так бы ты и над джеймсом стоял"
    "задницей над его лицом"
    j "хочу пожать на десять а башка после вчерашней пьянки болит ну и непонятно затащу ли"
    j "то есть возникает условие"
    j "в коде это бы выглядело так:"
    board "lifted = 0" 
    board "power = get_my_power() //каким-то образом посчитаем энергию" 
    board "while True:"
    board "if energy < get_required_energy(70): //сколько сил требуется чтобы пожать 70 кг" 
    board "break" 
    board "lifted += 1"
    board "power = waste_some_power_on_lift(70) //тоже каким-то образом энергия тратится" 
    "джеймс в теории мог взять тебя на руки и тягать вместо штанги"
    "да и дэйва по сути тоже, но об этой педерастии ты думать не стал"
    "ты мог сесть на гриф как стриптизерша"
    j "print помните?"
    j "вот это была функция это мы разберём попозже"
    j "процесс жима штанги тоже функция не пугайтесь"
    j "а вот while - это уже цикл"
    j "как у девочек ха-ха"
    l "почему не как мотоцикл?"
    show james smile with dissolve 
    j "для тру езды на мотоцикле нужна бицуха пузо пара наколок и капризная девка сзади чтоб сидела" 
    show lars smile with dissolve
    l "значит у вас мотоцикл есть?"
    show james sad with dissolve
    j "последний пункт отпал увы"
    show dave smile with dissolve
    d "не переживайте этот ныть умеет как следует будет вам тру"
    show lars please with dissolve
    "да ну тебя"
    show lars normal with dissolve
    menu:
        "я лучше на гелике покатаюсь":
            jump gelikbad
        "а вам не страшно на мотоцикле? вы такой смелый":
            jump motogood
    label gelikbad:
    show dave think with dissolve
    d "лучше с пацанами на велике чем с чертями на гелике"
    show lars please with dissolve
    l "поэтому я тебя кататься и не приглашаю"
    show james sad with dissolve 
    "джеймс печально посмотрел на тебя и на свою правую руку"
    "на загорелой коже белела полоска от кольца"
    show james normal with dissolve
    j "давайте вернёмся к теме"
    show lars normal with dissolve 
    jump lesson4continue
label motogood:
    show james smile with dissolve
    j "никогда не катался что ли?"
    show james normal with dissolve
    j "ха-ха а с виду такой оторва"
    show lars sad with dissolve
    d "пока мы в детстве паркур ебашили он в куклы игрался" 
    l "я зато себя берегу не то что некоторые"
    "ты ожидал, что джеймс подхватит троллинг вайб мастейна и добавит ещё что-то обидное"
    show james normal with dissolve 
    j "жизнь должна быть настоящей а не состоять из синтетического кайфа"
    "препод указал на торчащую из твоего кармана одноразку"
    menu:
        "я задумаюсь":
            jump jamesnone
        "а если вы меня на мотоцикле прокатите?":
            jump jamesgood3
label jamesnone:
    show lars normal with dissolve
    show james normal with dissolve
    j "цени жизнь такой какая она есть без допинга"
    j "это в будущем может на тебе сказаться"
    "тебе показалось, что он опять задумался о своей бабе капризной или как там было"
    "тебе во что бы то ни стало надо узнать, за что же та его бросила"
    j "давайте дальше учиться"
    jump lesson4continue
label jamesgood3:
    show james blush with dissolve
    j "только когда сдашь у меня экзамен"
    show lars smile with dissolve
    l "по рукам"
    show james smile with dissolve
    j "готовь памперсы - гнать я буду быстро"
    $jamesrel += 0.5
    show james normal with dissolve
    j "а пока что продолжим наше занятие"
    jump lesson4continue
    j "так вот - находящийся в блоке цикла код выполняется столько раз сколько написано в объявлении этого самого цикла"
    j "while переводится как 'пока'"
    j "пока действует условие код повторяется"
    j "True эквивалентно цифре 1 - это можно толковать по-разному например как наличие сигнала можно сказать да или правда"
    j "условие True прервать может только команда break или в частности return"
    "дэйв скучающе зевнул и осторожно сплюнул снюсину под крышку шайбы"
    "всё же, внимание друга было намертво зафиксировано на джеймсе и доске"
    "все попытки мозга отвлечься и думать о хуйне рыжий старательно пресекал, в отличие от тебя"
    l "а если написать while False что будет?"
    show james smile with dissolve
    show dave angry with dissolve
    d "короткое замыкание епта"
    j "ну зачем так строго"
    j "блок кода просто не выполнится"
    j "короткое замыкание вызывать надо не в user-mode а поближе к железу"
    show james normal with dissolve 
    j "но это совсем другая история"
    j "вы заметили отступы?"
    j "конкретно в python они означают блоки кода и если кто писал на си то там вместо них были бы фигурные скобки"
    d "вообще нет скобок? ну и чушь"
    menu:
        "чушь у тебя в штанах он же сказал - отступы вместо скобок":
            jump otstup
        "(молча слушать)":
            jump molch
label otstup:
    d "ты вообще скобки только чтобы смайлик весёлый нарисовать ставишь какое тебе дело"
    $dave_brain -= 1
    j "в си скобки выполняют роль того же оператора что и отступы в питоне"
    j "такой вот синтаксис что поделать"
    "но дэйв уже не слушал"
    "что-то его смогло задеть"
    "да, ты решил поумничать перед хэтфилдом как пикми девка, чтобы перехватить его внимание"
    "но с другой стороны, какая разница должна быть, если вы все равно в аудитории на паре?"
    jump lesson5continue
label molch:
    j "не всё чушь что не си плюс плюс - народная мудрость"
    show dave smile with dissolve 
    "дэйв улыбнулся, и тебе отчего-то стало чуть печальнее на душе"
    "не ты был в центре внимания"
    "не ты задал интересный вопрос"
    j "что в си что в питоне есть операторы обособляющие блок кода от других"
    j "тут это отступы и с этим можно просто смириться"
    d "или не писать на питоне лол"
    show james smile with dissolve
    j "да хоть калом на стене пиши после пар"
    show james normal with dissolve 
    j "языки полезно знать разные"
    j "для общего развития"
    show dave think with dissolve
    d "спасибо что даёте мне развиваться профессор хэтфилд"
    j "на здоровье дэйв) калом только за пределами учебного заведения пиши а то найду и отмывать заставлю"
    show lars please with dissolve
    l "его надо слизывать заставить"
    j "тогда из него выйдет тру питонист чё сказать"
    show dave angry with dissolve
    j "давайте продолжим"
    show dave think with dissolve
    jump lesson5continue
label lesson5continue:
    j "кроме while есть ещё одно ключевое слово запускающее цикл называется for"
    nvl clear
    board "from random import randint" 
    board "winners = [ ]" 
    board "last_participant_number = 130"
    board "for i in range(0, last_participant_number-1):"
    board "win = randint(i, last_participant_number) % 7 == 0"
    board "if win:"
    board "winners.append(i)"
    board "for winner in winners:"
    board 'print(f"(лотерейный билет {winner} победил")'
    "закончив с написанием этой непонятной чепушиной конструкции, джеймс довольно выдохнул и посмотрел на аудиторию, ожидая вопросов"
    "твой главный вопрос был - нахуя"
    "дэйв поднял руку чуть раньше, чем это собирался сделать ты"
    "тебе хотелось узнать, что это была за лотерея"
    "может, у джеймса было ровно last_participant_number секс-игрушек и он выбирал методом randint, какая из них окажется в твоей заднице"
    j 'любой вопрос кроме "ваш код говно" одобряется)'
    d "ну начнём с того что ваш код говно"
    show james smile with dissolve 
    j "говно у тебя в штанах))"
    show dave smile with dissolve 
    d "вам лучше не проверять что у меня в штанах однако формула рандомного выбора победителя - тот ещё черкаш"
    j "ха-ха красавчик заметил"
    show james normal with dissolve
    show lars please with dissolve
    "хэтфилд в открытую ловил общий вайб с мастейном, и тебе стало неприятно, что этот самый вайб пролетал сквозь твою персону"
    l "я тоже заметил вообще-то"
    j "ух ты!"
    j "ну ты даёшь) а объяснить сможешь? я оценку поставлю"
    show lars sad with dissolve
    l "блять"
    show lars normal with dissolve
    l "а процент напомните что такое пж"
    j "остаток от деления числа"
    d "да он от балды ляпнул что понимает его учить что мертвому хуй дрочить"
    j "дай ему шанс) мне самому интересно"
    "ты был в жопе!"
    "походу все победившие в лотерее секс-игрушки вот-вот в твоей как раз и окажутся"
    "а ты не мог понять,что не так было с формулой"
    "если остаток от деления i (или last_participant_number???) на 7 был равен нулю..."
    "мозг кипит"
    "шанс был только один"
    l "игра получилась нечестной..."
    menu:
        "так как i растёт у последних участников нет шанса никак":
            jump rightlot
        "так как i растёт у последних участников несправедливо большой шанс":
            jump wronglot
label wronglot:
    show james sad with dissolve
    $james_rel -= 1
    j "зачем понтоваться что знаешь если сам такой невдуплёныш?"
    show lars sad with dissolve
    l "простите пожалуйста"
    show james normal with dissolve
    j "ну не грусти сейчас все объясню"
    "ну не грусти, не все секс-игрушки окажутся внутри тебя, а лишь пока твоя попка способна их принять"
    "ты услышал это и принялся фантазировать" 
    j "функция randint выбирает случайный номер из диапазона i...last_participant_number"
    j "так как i растёт с каждой итерацией цикла"
    j "понимаешь ведь что будет когда она начнёт приближаться к концу диапазона?"
    l "нет...."
    "понимаешь ведь что будет когда вместимость твоей задницы начнет приближаться к концу предела?" 
    "джеймс зачем-то поправил рубашку, продемонстрировав светлые волосы на крупных предплечьях"
    "эти волосы обязательно слипнутся между собой от смазки когда он покроет ей руки чтобы как следует тебя растянуть"
    j "ну смотри"
    "ты посмотрел на его руки, с которых в твоём воображении уже стекала смазка и твои выделения"
    show eyes_closed
    "джеймс не станет с тобой церемониться"
    "тебе придётся как следует потерпеть и смириться с плачевной участью твоей ненасытной пока что узкой задницы"
    show eyes_opened
    j "чем меньше диапазон тем меньше вероятность что число поделится на 7"
    j "а у последних чисел она и вовсе равна нулю"
    j "от того и код говно"
    show lars normal with dissolve
    l "я... понял спасибо)"
    j "ну и молодец"
    j "продолжим урок"
    "продолжим растяжку"
    "ты мечтательно закрыл глаза"
    jump lesson6continue
label rightlot:
    $james_rel += 1
    show james smile with dissolve
    j "респект"
    j "только-только начал объяснять а ты всю тему прошарил"
    "в жопе рукой он у тебя прошарил, а ты ляпнул что попало, и угадал"
    "но джеймс так обрадовался"
    "надо бы уточнить про этот процент, чтобы ещё сильнее его убедить, что ты не совсем безнадёжен"
    "и что в твоей жопе можно рукой прошарить"
    show lars smile with dissolve
    l "это получается остаток от деления всегда разный? "
    j "да да и так как i растёт и диапазон рандома постепенно сужается"
    "а твоя жопа уже точно не сузится когда джеймс ей как следует займётся"
    j "в какой-то момент будет все меньше чисел способных делиться на 7 а потом они и вовсе исчезнут"
    l "о!"
    show lars normal with dissolve
    l "интересно!"
    show james smile with dissolve
    j "рад что тебе нравится"
    show james normal with dissolve
    j "давайте продолжать"
    jump lesson6continue
label lesson6continue:
    "дэйв уже тянул руку с целью спросить что-то умное"
    "джеймс кивнул головой"
    d "то что код говно мы выяснили но я так и не понял"
    d "а почему last_participant_number-1?"
    d "что захватывает в себя функция range?"
    "что захватывает в себя range, тебе было насрать, но то, что твоя жопа могла теоретически (хотелось бы проверить и на практике) захватить руку джеймса, казалось гораздо более интересным экспериментом"
    j " range включает в себя последний номер и первый, оба не выпадают из множества"
    d "а разве лотерея идёт с нуля?"
    show james blush with dissolve
    j "какой же ты внимательный а дэйв"
    show james normal with dissolve
    j "все по факту сказано - индекс начинается с 1 и заканчивается ровно максимальным номером участника"
    j "а я отвлёкся ошибся"
    j "а был бы массив - мы бы правда вычли единицу с целью избежать исключения out of range"
    "твоя пикми натура настойчиво требовала внимания"
    "почему именно дэйв заметил ошибку?"
    show lars smile with dissolve 
    l "а вы смотрю тот ещё говнокодер а"
    show james smile with dissolve 
    j "не заигрывайся тут"
    show james normal with dissolve 
    j "материал надо закрепить"
    "вот бы джеймс заполнил водой шланга твою задницу до предела и дабы этот процесс закрепить, заткнул твою жопу большой анальной пробкой"
    j "сейчас дам задание и посмотрим кто из нас говнокодер)"
    "это было куда скучнее"
    "тупой задротский джеймс"
    j "у кого есть какие вопросы?"
    d "эй никелодеон ты слушал его хоть"
    show nick smile with dissolve 
    n "да да я даже спросить хотел"
    show dave angry with dissolve 
    d "дык спроси чё у тебя аура слабая что ли сидишь и ссышься"
    n "моя аура настолько сильная что я передал этот вопрос телепатией"
    d "хуепатией"
    d "спрашивай давай"
    show nick normal with dissolve 
    n "эм мистер хэтфилд а вот без break или без условий цикл while может работать?"
    j "ну в частных случаях да"
    j "а так - ну заклинит твою программу особенно если это сайт или приложение"
    n "а я видел что в робототехнике циклы работают бесконечно и ничего не клинит"
    show james smile with dissolve
    j "ну ты сравнил жопу с пальцем"
    show james normal with dissolve 
    j "то что ты упомянул и есть частный случай"
    j "там правда цикл бесконечный"
    show dave smile with dissolve 
    d "а чего тебе в робототехнике нравится?"
    n "а да я это робота хочу музыкального сделать"
    show james smile with dissolve 
    j "респект"
    show james normal with dissolve 
    "тебя удивило, как это обрадовали джеймса, но ты слишком хотел спать, чтобы закидывать его личными вопросами"
    show dave think with dissolve 
    d "а что за музло будет?"
    n "ну что мне по кайфу слушать"
    show dave angry with dissolve 
    d "блять я будто двадцать лет твою сраку небритую нашампуриваю откуда мне знать что ты слушаешь"
    show nick sad with dissolve 
    n "ну там джаз всякий"
    n "технично рок ну не тупорылый а что абстракция"
    show nick normal with dissolve 
    show dave think with dissolve 
    d "абасракция"
    d "пон"
    j "ну чего на пары разбиваемся придумываем применение цикла и пишем кто во что горазд"
    j "до конца пары время даю как раз немного осталось"
    d "ладно шайтан пишем твоего снюсового робота"
    "дэйв пересел к нику, оставив тебя в одиночестве и недоумении"
    show kirk smile with dissolve
    k "ты смотрю один остался"
    l "ну чё присоединяйся будем вместе голландский штурвал сооружать"
    k "ты хоть раз в жизни это дело пробовал?"
    "кирк, поначалу создавший впечатление человека излишне кулюторного, оказался весьма вайбовым поцыком"
    show lars smile with dissolve
    l "ну давай рассказывай про все подводные ща в коде соорудим"
    k "это не так сложно как тебе кажется"
    k "я если что себя за свой экспериенс не осуждаю"
    show lars normal with dissolve
    l "еще бы за такое осуждать"
    l "я понимаю проиграть в печеньку или быть попуском"
    show lars smile with dissolve
    l "давай колись мне интересно"
    show kirk smile with dissolve
    k "ну бля ничего такого там нет"
    k "как говорится смотреть можно трогать нельзя"
    k "на чужую волыну поглядел ну больше сказать нечего"
    l "я бы на волыной одного здесь присутствующего полюбовался бы как следует"
    show kirk normal with dissolve
    k "это уже пидорасня какая-то"
    show kirk smile with dissolve
    k "давай лучше код писать"
